{
    "articales": [
        {
            "id": "1",
            "title1": "Разговор с самим собой: вопросы, которые нужно задать себе, прежде чем заводить собаку",
            "subTitle": "Нужно помнить о том, что собака - это всегда большая ответственность. Задайте себе эти вопросы, чтобы понять, готовы ли вы к этому шагу.",
            "img": "./assets/img/articales/img/articles-details/статья1_биг.jpg",
            "body": [
                {
                    "type": "paragraph",
                    "text": "Пролистав десятки или даже сотни умилительных фотографий щенков, вы, возможно, убедили себя в том, что полностью готовы к появлению в вашей жизни нового питомца. Но забота о щенке или взрослой собаке — это обязательство, которое вам предстоит брать на себя полный рабочий день без выходных в течение многих лет. Очень важно проверить себя, прежде чем принять эту очаровательную, но в то же время серьезную ответственность."
                },
                {
                    "type": "title",
                    "text": "Осознаете ли вы обязанности хозяина?"
                },
                {
                    "type": "paragraph",
                    "text": "Владение щенком - это намного больше, чем обнимашки и забавные фотографии.  Рассматривая вопрос о приобретении собаки, не забудьте подумать о неизбежных тратах, посещениях ветеринара, регулярных учебных занятиях, длительных прогулках не только в безоблачную погоду и бесчисленном множестве других обязанностей, которые лягут на ваши плечи"
                },
                {
                    "type": "paragraph",
                    "text": "Это ваш маленький друг и живое, трепетное, любящее существо, чьи потребности вам будет необходимо поставить выше своих собственных. Готовы ли вы внести коррективы в свои планы на вечер, чтобы посвятить его порой не самым увлекательным обязанностям ответственного хозяина?"
                },
                {
                    "type": "title",
                    "text": "Готовы ли вы к необходимым финансовым вложениям?"
                },
                {
                    "type": "paragraph",
                    "text": "Когда вы впервые принесете своего щенка домой, вы автоматически возьмете на себя ответственность за посещение ветеринарных осмотров, приобретение необходимых лекарств и поддержание здоровья вашей собаки в целом.  Вам также нужно будет неоднократно приобрести специальные лежанки, ящики, поводки и ошейники, миски для корма и, собственно, корм разных видов, игрушки, лакомства... этот список можно продолжать долго."
                },
                {
                    "type": "paragraph",
                    "text": "Если вы не можете находиться с собакой в течение всего дня, придётся заняться поиском няни или профессионального догситтера, чтобы обеспечить необходимый уход вашему щенку. На самом деле это выгодное финансовое решение, но все же эти затраты следует учитывать, если вы думаете о том, чтобы завести щенка в ближайшем будущем."
                },
                {
                    "type": "title",
                    "text": "Сможете ли вы полностью изменить образ жизни?"
                },
                {
                    "type": "paragraph",
                    "text": "Будьте готовы к тому, что новый член семьи перевернёт вашу жизнь с ног на голову. Вам придётся возвращаться домой строго к определенному времени, вкладывать много сил в воспитание щенка и быть готовым выйти на прогулку даже тогда, когда гулять не хочется совсем. Ничего страшного, если вы ещё не готовы пойти на компромисс и настолько резко изменить свои текущие привычки, однако это может означать, что пока вы не готовы к появлению в вашем доме собаки."
                },
                {
                    "type": "paragraph",
                    "text": "Щенки — это беспорядок! И это нормально. Они вполне могут погрызть все подушки в вашем доме прежде, чем вы заметите это и успеете что-либо предпринять, или оставить лужицу в самом неподходящем месте. Вам просто необходимо научиться проявлять терпение и гибкость, сохраняя при этом твердость характера."
                },
                {
                    "type": "paragraph",
                    "text": "Попытайтесь представить, где вы видите себя через два года или даже через пять лет. Планируете переехать в большой город? Мечтаете о детях в ближайшем будущем?  Это примеры серьезных жизненных изменений, которые следует учитывать при приобретении собаки и, например, выборе подходящей породы."
                },
                {
                    "type": "title",
                    "text": "Живете один — вопросов нет, но в противном случае..."
                },
                {
                    "type": "paragraph",
                    "text": "Члены семьи или соседи по комнате —неважно. Вне зависимости о того, насколько вы близки, важно согласовать это решение со всеми, кто живет с вами. Если даже один человек не испытывает энтузиазма, это может стать причиной стрессовой ситуации как для людей, так и для нового питомца."
                },
                {
                    "type": "paragraph",
                    "text": "Убедитесь, что никто в вашем доме не страдает от аллергии — эта особенность может повлиять на породу собаки, которую вы в итоге выберете."
                },
                {
                    "type": "paragraph",
                    "text": "Итак, это лишь некоторые из важных вопросов, которые вы должны рассмотреть, прежде чем принести в дом щенка. Мы рекомендуем внимательно изучить, какие породы лучше всего подходят для вашего образа жизни и членов вашей семьи.  Если вы все еще не уверены, пожалуйста, не стесняйтесь обсуждать любые вопросы со своим потенциальным заводчиком или приютом. Специалисты с удовольствием поделятся знаниями и многолетним опытом и помогут принять единственно верное решение."
                }
            ]
        },
        {
            "id": "2",
            "title1": "7 важных изменений, которые произойдут в вашей жизни с появлением питомца",
            "subTitle": "Сложно вообразить, насколько сильно изменится ваша жизнь, когда в ней появится новый домашний любимец. В этой статье мы расскажем о 7 главных переменах, к которым непременно нужно быть готовым.",
            "img": "./assets/img/articales/img/articles-details/статья2_биг.jpg",
            "body": [
                {
                    "type": "paragraph",
                    "text": "Долгожданный момент встречи с новым членом семьи – это всегда волшебное и незабываемое событие. Вы готовились, планировали и мечтали об этом дне так долго, и, наконец, все случилось! Вот теперь щенок дома и… Что же дальше?"
                },
                {
                    "type": "title",
                    "text": "1. Полюбите прогулки на свежем воздухе: будьте готовы выводить щенка на улицу каждые пару часов"
                },
                {
                    "type": "paragraph",
                    "text": "Первое время щенок может держать мочу совсем недолго – в течение всего нескольких часов (максимум 4 часа, зависит от породы). Поэтому, если вы хотите приучить свою собаку регулярно ходить в туалет на улице, сперва выходить на прогулку придется довольно часто – примерно каждые 1-2 часа."
                },
                {
                    "type": "title",
                    "text": "2. Прежде приучите к порядку себя, а затем принимайтесь за воспитание щенка"
                },
                {
                    "type": "paragraph",
                    "text": "Придется запастись бумажными полотенцами, моющими средствами и стоическим терпением – научить щенка хорошим манерам получится не сразу. Будьте готовы к оперативному устранению всех видов беспорядков, от испорченной мебели или погрызанной пары любимых кроссовок, до лужиц не самого загадочного происхождения, однако зачастую в самых неожиданных местах"
                },
                {
                    "type": "title",
                    "text": "3. Обезопасить нужно не евроремонт от щенка, а щенка от возможных опасностей вашего дома"
                },
                {
                    "type": "paragraph",
                    "text": "Прежде, чем принести домой нового питомца, необходимо убедиться, что ваш дом является безопасным местом для жизни и непременных исследований активного и любознательного щенка. Спрячьте все открытые провода, поместите чистящие средства в недоступное для собаки место, убедитесь, что еда (как человеческая, так и собачья) также надежно спрятана и так далее. Проявите должную ответственность, ведь ваш питомец научится быть ответственным только со временем."
                },
                {
                    "type": "title",
                    "text": "4. Скорректируйте распорядок дня – теперь у вас есть комендантский час"
                },
                {
                    "type": "paragraph",
                    "text": "Чтобы обеспечить щенку должный уход, а также дать ему любовь и заботу, в которой он действительно нуждается, вам необходимо всегда быть дома в определенное время. Даже если вы пользуетесь услугами догситтера, питомец потребует много именно вашего внимания и времени для социализации, обучения, игр, объятий и прогулок. Вполне возможно, вам придется отказаться от нескольких встреч с друзьями после работы, чтобы быть дома вовремя и правильно заботиться о своем щенке."
                },
                {
                    "type": "title",
                    "text": "5. Селфи отдельно, собаки отдельно – создайте питомцу собственный аккаунт в Instagram, если не можете противостоять соблазну"
                },
                {
                    "type": "paragraph",
                    "text": "Помните, что не все ваши друзья будут в восторге от целой коллекции схожих фото даже самого милого щенка на свете, – не стоит регулярно выкладывать эти шедевры на личной странице. Вы можете обнаружить (и, скорее всего, это случится с вами), что хотите поделиться с миром своим очаровательным питомцем намного больше, чем сами могли того ожидать, и это здорово. Социальные сети ждут ваших кадров – вперед!"
                },
                {
                    "type": "title",
                    "text": "6. Снова в школу – запишите щенка на занятия"
                },
                {
                    "type": "paragraph",
                    "text": "Теперь вы – настоящий родитель для своего питомца, не забудьте определить его в школу. Специальные занятия всего раз или два в неделю на самом деле очень важны как для социализации, так и для обучения и воспитания вашего щенка. Курсы помогут щенку освоить простые команды, а вас научат правильно дисциплинировать и хвалить свою собаку."
                },
                {
                    "type": "title",
                    "text": "7. Работайте над собой и измените свою жизнь – научитесь жить ради того, кого любите"
                },
                {
                    "type": "paragraph",
                    "text": "Вполне возможно, что появление в вашей жизни собаки принесет намного больше волнующих перемен, чем вы ожидали и планировали. Иногда вы будете уставать – это нормально. Вы будете вкладывать ваше время, силы и другие средства в нового питомца, который непременно отплатит вам безграничной и трогательной любовью. Этот уровень ответственности и осознанности станет новым важным этапом, прежде всего, для вас – не бойтесь и будьте готовы менять свою жизнь к лучшему вместе с вашим маленьким другом."
                }
            ]
        },
        {
            "id": "3",
            "title1": "Подарок с душой: 5 вещей, о которых нужно подумать, прежде чем подарить щенка",
            "subTitle": "Мы все видели трогательные рекламные ролики, в которых члены семьи дарят любимому человеку лучший подарок в его жизни – прелестного щенка, как правило, с большим красным бантом на шее. Однако в реальной жизни эта счастливая сцена может выглядеть несколько по-другому.",
            "img": "./assets/img/articales/img/articles-details/статья3_биг.jpg",
            "body": [
                {
                    "type": "paragraph",
                    "text": "В этой статье мы собрали основные моменты, которые вам стоит обдумать, прежде чем удивлять кого-то очаровательным, но требующим настоящей ответственности подарком."
                },
                {
                    "type": "title",
                    "text": "1. Человек должен быть эмоционально готов к щенку"
                },
                {
                    "type": "paragraph",
                    "text": "Если вы читали другие статьи Petman, вы уже знаете, сколько работы (времени, денег, усилий и внимания) уходит на воспитание щенка. Искренне желая преподнести идеальный подарок, вы не задумываетесь о том, что на самом деле помещаете человека в стрессовую ситуацию, не оставляя времени на необходимую психологическую подготовку к ней. Правильно будет дарить домашнее животное только тем людям, которые уже самостоятельно проявляли интерес к владению питомцем, и в способности которых ответственно ухаживать за ним вы уверены. Поэтому, если ваш друг неоднократно упоминал о желании приобрести собственную собаку, вы действительно можете серьезно подумать о таком подарке."
                },
                {
                    "type": "title",
                    "text": "2. Финансовое положение человека позволяет ему заботиться о собаке"
                },
                {
                    "type": "paragraph",
                    "text": "Уход за новым щенком может стоить значительно больше, чем вы предполагаете. Поэтому вам необходимо убедиться в том, что ваш друг не просто хочет, но действительно готов взять на себя финансовую ответственность за нового питомца, потому что в противном случае последствия вашего праздничного решения могут оказаться действительно печальными…"
                },
                {
                    "type": "title",
                    "text": "3. Подаренные щенки чаще других остаются брошенными"
                },
                {
                    "type": "paragraph",
                    "text": "Это правда. Праздники – это не только веселье и подарки, это еще и довольно беспокойное и даже напряженное для некоторых людей время. Поэтому внезапное возникновение в жизни новых обязанностей, связанных с незапланированным появлением нового члена семьи, требующего внимания и заботы, часто может лишь поднять уровень стресса в эти дни. По статистике, в первые месяцы после праздников количество случаев отказа от собак увеличивается в несколько раз – многие люди просто не справляются с новыми обязательствами и напряжением, которое, безусловно, влечет за собой появление в доме щенка."
                },
                {
                    "type": "title",
                    "text": "4. Дарите ребенку щенка, если к этому готовы его родители"
                },
                {
                    "type": "paragraph",
                    "text": "Да, собак часто дарят детям, чтобы научить их быть ответственными: предполагается, что ребенок должен выгуливать собаку, убирать за ней, кормить и так далее. Однако нельзя забывать о том, что дети – это всего лишь дети, они не всегда будут думать об ответственности. Поэтому родители должны быть непременно осведомлены о ваших намерениях, ведь большую часть ухода за питомцем и полное финансовое обеспечение им придется взять на себя."
                },
                {
                    "type": "title",
                    "text": "5. Сюрприз – не всегда лучший подарок"
                },
                {
                    "type": "paragraph",
                    "text": "Подумайте о том, чтобы сперва подарить зоотовары или, например, книгу по уходу за домашними животными. Также вы можете предложить другу самостоятельно выбрать и забрать питомца."
                },
                {
                    "type": "paragraph",
                    "text": "Конечно, это не так весело, как устраивать грандиозный сюрприз с шариками и подарочной упаковкой, но такая предварительная подготовка поможет избежать возможного возникновения чувства подавленности или стресса. Таким образом вы можете точно определить, о каком щенке мечтает потенциальный хозяин и готов ли он к нему в данный момент. Так никто не будет разочарован."
                },
                {
                    "type": "paragraph",
                    "text": "Собака – это все же не очередной подарок и не временное увлечение, которое с легкостью можно оставить, когда оно наскучит. Появление щенка в любой семье должно рассматриваться как серьезная (и замечательная) возможность заботиться о другой жизни. Не стоит пренебрегать ответственностью, чтобы сохранить привлекательный эффект неожиданности. Как правило, лучшим вариантом все же будет предупредить человека заранее, обговорить все нюансы и помочь найти щенка, который идеально подойдет для него и его образа жизни."
                }
            ]
        },
        {
            "id": "4",
            "title1": "Как отличить надежного и уважаемого заводчика?",
            "subTitle": "Результатом работы с проверенным и ответственным питомником станет крепкая и счастливая дружба с вашим питомцем на протяжении долгих лет, в то время как сотрудничество с непрофессиональным или неэтичным заводчиком может привести к серьезным трудностям, которые будут сопровождать вас многие годы.",
            "img": "./assets/img/articales/img/articles-details/статья4_биг.jpg",
            "body": [
                {
                    "type": "paragraph",
                    "text": "Стать владельцем собаки – это одно из самых важных и, одновременно, прекрасных решений, которые вы когда-либо принимали. В вашей жизни появится безусловная и всеобъемлющая любовь, в основе которой все же лежит большая и серьезная ответственность. Первый и самый важный выбор, который вам предстоит сделать, - это выбор питомника, из которого вы заберете вашего нового друга."
                },
                {
                    "type": "paragraph",
                    "text": "Обращение к опытному заводчику дает вам уверенность в том, что ваш щенок будет счастливым и здоровым, так как в проверенных питомниках о собаках действительно заботятся, как о полноценных членах семьи. Их главная цель – вырастить здоровых, хорошо приспособленных к различным условиям щенков и убедиться, что они попадут в теплые и счастливые дома, где им будет обеспечен должный уход. Важно, чтобы еще до фактического разведения, заводчик удостоверился, что собаки-родители сильны, здоровы и обладают отличными характеристиками для передачи их следующему поколению щенков."
                },
                {
                    "type": "paragraph",
                    "text": "Но как распознать действительно хорошего заводчика? В этой статье мы собрали все ключевые моменты, которым профессиональный заводчик непременно уделяет внимание."
                },
                {
                    "type": "title",
                    "text": "Здоровье"
                },
                {
                    "type": "paragraph",
                    "text": "Первостепенная задача владельца собаки состоит в поддержании здоровья своего пушистого друга. Однако важно понимать, что независимо от того, насколько ответственно вы подходите к уходу за своим щенком, основа его будущего благополучия закладывается еще в питомнике, в первые дни его жизни."
                },
                {
                    "type": "paragraph",
                    "text": "Ответственные заводчики тщательно следят за здоровьем собак-родителей, проверяя их на наличие наследственных заболеваний и делая все возможное, чтобы их щенки имели наилучшие шансы родиться совершенно здоровыми. Такие заводчики заботятся обо всех потребностях щенков, уделяя значительное внимание созданию комфортных условий для их жизни, медицинским осмотрам, включающим все необходимые анализы и прививки, и другим значимым аспектам правильного ухода за щенком в раннем возрасте. Из-за большого количества сложных медицинских нюансов заводчиками нередко становятся дипломированные ветеринары и зоотехнологи. А заводчики, не имеющие профильного образования, как правило, сотрудничают с проверенным ветспециалистом на постоянной основе."
                },
                {
                    "type": "paragraph",
                    "text": "Платформа Petman обеспечивает доступность и абсолютную прозрачность всех медицинских тестов, когда-либо проводимых на племенных собаках. Опираясь на эти данные, вы сможете не только убедиться в состоянии здоровья будущего питомца, но и обсудить с вашим заводчиком профилактические меры, необходимые для правильного ухода за щенком."
                },
                {
                    "type": "paragraph",
                    "text": "Лучшие заводчики могут заслуженно гордиться той важнейшей и во многом определяющей работой, которую они проделывают в эти ключевые первые дни, закладывая надежный фундамент здоровья и счастья щенка на всю жизнь."
                },
                {
                    "type": "title",
                    "text": "Стоимость"
                },
                {
                    "type": "paragraph",
                    "text": "Теперь, когда вы знаете, сколько труда и заботы ответственные заводчики вкладывают в каждого отдельного щенка, вы понимаете, почему сумма депозита, который они просят за свою работу,часто превышает ту, которую обозначают сомнительные непрофессиональные питомники. Однако, в конечном итоге, работа с проверенным заводчиком – это не только надежно, этично и психологически комфортно, но и разумно с экономической точки зрения."
                },
                {
                    "type": "paragraph",
                    "text": "Причина, по которой так называемые фермы по разведению собак готовы предложить вам более низкую цену, заключается в том, что, экономя собственные силы, время и денежные средства, они полностью игнорируют здоровье своих собак. Тем не менее, не стоит обращать внимание на подобные «выгодные» предложения, ведь в долгосрочной перспективе щенок с нарушениями здоровья и поведения обойдется своему хозяину значительно дороже."
                },
                {
                    "type": "paragraph",
                    "text": "Работа с ответственными заводчиками – это, прежде всего, уверенность в том, что ваш щенок и его родители были проверены на наличие наследственных заболеваний и общих проблем со здоровьем."
                },
                {
                    "type": "paragraph",
                    "text": "Важно также принимать во внимание, что хорошие заводчики позаботятся о правильном питании, социализации и грамотном раннем развитии вашего будущего щенка в течение первых недель после его рождения, что потребует от них не только усилий и времени, но и немалых финансовых вложений. Именно эти факторы определяют итоговую стоимость щенка, выращенного ответственным и авторитетным заводчиком, которая, на самом деле, всегда является полностью оправданной."
                },
                {
                    "type": "title",
                    "text": "Воспитание"
                },
                {
                    "type": "paragraph",
                    "text": "Работа профессионального заводчика не ограничивается заботой о физическом здоровье своих щенков. Другая большая и важная его обязанность - это обеспечение психического здоровья и благополучия новых собак, которых они приносят в мир. В некотором смысле забота об эмоциональном развитии щенков является еще более сложной задачей, поскольку она требует специального опыта, пристального внимания и индивидуального подхода."
                },
                {
                    "type": "paragraph",
                    "text": "Довольно часто переезд в новый дом с новым владельцем вызывает у щенка страх, агрессию и другие социальные проблемы. Опытные и ответственные заводчики знают это, поэтому они с первых недель начинают готовить щенка к этому большому моменту в его жизни. Щенки постепенно и аккуратно подвергаются воздействию условий, которые ждут их в новом доме - домашние звуки, новые пугающие предметы, незнакомые жители, в том числе дети или пожилые люди и так далее. Также заводчик закладывает надежную основу, позволяющую значительно облегчить и ускорить процесс формирования привычек уже будущим хозяином щенка, среди которых, например, приучение к туалету или сну в специально отведенном месте."
                },
                {
                    "type": "paragraph",
                    "text": "Безусловно, хороший заводчик будет внимателен и к потенциальному владельцу щенка и захочет удостовериться в том, что, во-первых, его покупатель станет ответственным, старательным и любящим хозяином и, во-вторых, он действительно хорошо подходит для конкретной собаки. Некоторые заводчики проводят тестирование темперамента щенка, чтобы подобрать для него наиболее подходящего владельца было проще. Главной задачей заводчика на данном этапе является предотвращение возможности возвращения щенка в питомник или, что еще хуже, его оставления. Действительно профессиональный заводчик будет некоторое время наблюдать за жизнью щенка в новом доме, чтобы в случае необходимости проконсультировать неопытного хозяина и наверняка убедиться в том, что питомец здоров, ухожен, и счастлив"
                },
                {
                    "type": "title",
                    "text": "Благополучие животных"
                },
                {
                    "type": "paragraph",
                    "text": "Ответственные заводчики внимательно заботятся о своих племенных собаках, обеспечивая им постоянную медицинскую помощь, а также максимально комфортные условия жизни и размножения. Многие заводчики с удовольствием предоставят вам фотографии своего питомника или предложат связаться по видео-чату, чтобы показать условия жизни щенков. В хорошем питомнике всегда достаточно места, еды и воды, есть свободный доступ к открытым или закрытым пространствам (в зависимости от потребностей в упражнениях и погодных условий), имеются удобные спальные/зоны отдыха, разнообразные игрушки и необходимый специализированный инвентарь."
                },
                {
                    "type": "paragraph",
                    "text": "Будьте готовы к тому, что первое время заводчик захочет оставаться с вами на связи, наблюдая за жизнью и развитием щенка. Это абсолютно нормальная практика в работе с высокопрофессиональными заводчиками."
                },
                {
                    "type": "paragraph",
                    "text": "Очевидно, что разница между ответственными и безответственными питомниками очень велика. Именно поэтому так важно убедиться, что вы обратились к надежному заводчику, которому действительно можно доверять. "
                },
                {
                    "type": "paragraph",
                    "text": "Обратите внимание на то, что абсолютно все заводчики, представленные на нашей платформе, прошли скрининг, подтвердили высокий уровень своего профессионализма и соответствие всем стандартам Petman. "
                }
            ]
        },
        {
            "id": "5",
            "title1": "Доброе дело: почему приюты – это действительно важно.",
            "subTitle": "Приюты и работающие в них волонтеры делают невероятную, благородную, спасающую множество жизней работу. Однако, когда вы выбираете собаку в одной из таких организаций, вы хотите быть полностью уверены, что абсолютным приоритетом ее работников является здоровье, благополучие и счастье животных. И это правильно.",
            "img": "./assets/img/articales/img/articles-details/статья5_биг.jpg",
            "body": [
                {
                    "type": "paragraph",
                    "text": "Грамотно выстроенные отношения между приютом и потенциальным владельцем собаки невероятно важны. Необходимо, чтобы вся информация о том, каким образом собака попала в приют, а также данные обо всех даже не самых значительных проблемах со здоровьем или поведением были абсолютно прозрачны и не утаивались от будущего хозяина. С другой стороны, сотрудники приюта должны убедиться, что потенциальные хозяева смогут обеспечить своему питомцу все необходимое, включая базовые комфортные условия жизни, специализированное обучение или устранение проблем со здоровьем в том случае, если они есть. Игнорирование этих важных шагов может привести к повторному отказу от собаки, что, разумеется, только ухудшит ее состояние."
                },
                {
                    "type": "paragraph",
                    "text": "Команда Petman помогает сделать коммуникацию с приютами на протяжении всего процесса максимально открытой, чтобы построить и поддерживать надежные отношения, которые так важны. Совместно с экспертами мы занимаемся разработкой понятных стандартов, гарантирующих, что приюты и другие спасательные организации, представленные на нашей платформе, видят своим главным приоритетом именно благополучие и здоровье животных."
                },
                {
                    "type": "paragraph",
                    "text": "Не менее важно, что хороший приют – это финансово ответственная организация. Движения денежных средств в них полностью прозрачны, так как они являются некоммерческими организациями. Эта особенность гарантирует, что главная цель выбранного вами приюта – это спасение животных и забота о них, а не финансовая выгода."
                },
                {
                    "type": "paragraph",
                    "text": "Все просто: выбор проверенного приюта – лучший способ обеспечить долгую и счастливую жизнь с вашей новой собакой. Будьте внимательны."
                }
            ]
        },
        {
            "id": "6",
            "title1": "Как распознать щенка, выращенного на «ферме»",
            "subTitle": "Вполне возможно, вы слышали о существовании так называемых щенячьих ферм, но знаете ли вы, что на самом деле скрывается за этим известным словосочетанием?",
            "img": "./assets/img/articales/img/articles-details/статья6_биг.jpg",
            "body": [
                {
                    "type": "paragraph",
                    "text": "Собачья ферма - это организация, занимающаяся выращиванием («производством») щенков, главная и единственная цель которой состоит в получении максимальной прибыли."
                },
                {
                    "type": "paragraph",
                    "text": "Быть хорошим заводчиком не только сложно, но и дорого – каждый профессиональный питомник берет на себя значительные затраты на обеспечение комфортных условий для жизни собак, необходимую ветеринарную помощь и медицинские тестирования животных на наличие наследственных заболеваний. Щенячьи фермы же игнорируют эти важные шаги, таким образом минимизируя собственные затраты и максимизируя прибыль."
                },
                {
                    "type": "paragraph",
                    "text": "Собачьи фермы бывают разных размеров, от больших и достаточно успешных организаций до совсем маленьких частных магазинов, но все они объединены бесчеловечным подходом, в котором собака – это лишь неодушевленный товар и способ быстрого заработка."
                },
                {
                    "type": "paragraph",
                    "text": "Исследования показали, что питомцы, купленные в зоомагазинах, которые, в свою очередь, с целью экономии приобрели щенков на подобных фермах, значительно чаще имеют проблемы со здоровьем и серьезные отклонения в поведении."
                },
                {
                    "type": "paragraph",
                    "text": "Необходимо относиться к выбору заводчика крайне внимательно и ответственно. Если, изучая потенциальный питомник, вы обнаружили пугающие фотографии переполненных комнат или запертых тесных клеток, большое количество грязи и животных, которые выглядят испуганными, ослабленными или больными, это явные признаки неэтичной организации или, другими словами, фермы. Если в интернет-магазине представлено множество щенков, доступных к моментальному заказу, это также довольно серьезный признак безответственного заводчика."
                },
                {
                    "type": "paragraph",
                    "text": "Профессиональные заводчики обычно специализируются на разведении всего одной или нескольких пород собак. Таким образом, они могут полностью сосредоточиться на здоровье и благополучии своих животных и быть в курсе последних научных и медицинских тенденций, характерных именно для конкретной породы. Поэтому, если магазин или заводчик предлагает большое разнообразие пород, есть неплохой шанс, что данная организация экономит средства на уходе, необходимом для выведения счастливых и здоровых собак."
                },
                {
                    "type": "paragraph",
                    "text": "Важнейшая миссия Petman состоит в том, чтобы, избегая неэтичные и ненадежные организации, объединить будущих хозяев и проверенных ответственных заводчиков, чтобы вместе они смогли дать каждой собаке то, в чем она нуждается, - необходимый уход, заботу и любовь."
                }
            ]
        },
        {
            "id": "7",
            "title1": "Как распознать ненадежного заводчика?",
            "subTitle": "К сожалению, многие неэтичные и непрофессиональные заводчики продолжают преуспевать лишь по той причине, что неопытные потенциальные хозяева просто не знают, как их обнаружить и избежать. Это серьезная проблема, требующая эффективного решения прямо сейчас",
            "img": "./assets/img/articales/img/articles-details/статья7_биг.jpg",
            "body": [
                {
                    "type": "paragraph",
                    "text": "Завести собаку – это совсем не то же самое, что сходить в магазин за новой парой обуви. Отправляясь прогуляться в зоомагазин, невозможно выйти через час с новым щенком – процесс выбора и приобретения питомца, на самом деле, намного серьезнее и сложнее. Ответственные заводчики гораздо более внимательны к потенциальному хозяину одного из своих щенков, чем безразличный кассир в розничном магазине или заинтересованный лишь в материальной выгоде онлайн-дилер. Так, первое, что необходимо запомнить: если кто-то готов продать вам собаку, словно это пара кроссовок, это явный сигнал тревоги."
                },
                {
                    "type": "paragraph",
                    "text": "Хорошие заводчики никогда не будут относиться к животному подобным образом, ведь они четко осознают, что уход за собакой – это, в первую очередь, огромная ответственность и нелегкий труд. Поэтому работники надежных питомников сделают все возможное, чтобы помочь вам найти действительно идеальную собаку, соответствующую вашему темпераменту, образу жизни и реальным ожиданиям от появления в семье маленького любимца."
                },
                {
                    "type": "paragraph",
                    "text": "Важнейшая миссия Petman заключается в отборе проверенных заводчиков посредством специально разработанных стандартов и обязательного скрининга. Тем не менее, важно знать главные качества, характеризующие плохого заводчика, чтобы вы всегда могли обезопасить себя от достаточно рискованного взаимодействия с ними. Информация, которую вы найдете в этой статье, поможет вам принять обдуманное решение и найти своего нового лучшего друга."
                },
                {
                    "type": "title",
                    "text": "Здоровье"
                },
                {
                    "type": "paragraph",
                    "text": "Собака из зоомагазина или любого другого сомнительного источника, вероятнее всего, обойдется вам ощутимо дешевле, чем щенок из авторитетного питомника. Однако такая «выгода» основывается на неэтичном, а иногда даже преступном отношении к животным и их здоровью. Безответственный заводчик относится к своим собакам, как к механизмам на заводе, используя их для производства помета за пометом, мало заботясь об их благополучии или благополучии их потомства."
                },
                {
                    "type": "paragraph",
                    "text": "Так называемые щенячьи фермы пытаются сэкономить максимальное количество денег, отказываясь от  ветеринарной помощи, базового обучения, качественного корма и других необходимых условий комфортной жизни и правильного развития щенков. Деятельность таких заводчиков – это прямое проявление жестокости и ужасающей халатности, а сотрудничество с ними небезопасно, неэтично и может повлечь за собой серьезные негативные последствия вплоть до отказа от щенка, приобретенного таким образом."
                },
                {
                    "type": "paragraph",
                    "text": "Отсутствие ветеринарной помощи означает, прежде всего, размножение истощенных и нездоровых собак, что значительно увеличивает риски как для матери, так и потомства. Это также означает игнорирование самого важного теста на серьезные наследственные заболевания, которому перед размножением непременно должны быть подвергнуты оба родителя. В противном случае незамеченными могут остаться такие опасные отклонения, как дисплазия колена и тазобедренного сустава, различные генетические заболевания или проблемы в работе сердца разной степени тяжести. Главная опасность состоит в том, что все эти болезни могут передаваться новым поколениям щенков, разрушая их физическое и эмоциональное здоровье и шансы на счастливую и долгую жизнь."
                },
                {
                    "type": "title",
                    "text": "Стоимость"
                },
                {
                    "type": "paragraph",
                    "text": "Если вас по-прежнему привлекает финансовая выгода, подумайте о том, что в долгосрочной перспективе щенок с нарушениями здоровья и поведения обойдется вам значительно дороже. Лечение собаки с диагнозом наследственного заболевания может быть очень дорогостоящим, продолжительным и болезненным. Хронические болезни повлекут за собой растущую оплату регулярных медицинских счетов, которые не покрывают еще целый ряд непременных дополнительных расходов, в числе которых, например, оплата неотложной ветеринарной помощи, в которой часто нуждаются собаки, рожденные с заболеваниями и инвалидностью. Забота о больном животном потребует от вас целого состояния, но будьте готовы к тому, что даже дорогостоящее лечение не всегда сможет избавить вашего питомца от страданий."
                },
                {
                    "type": "paragraph",
                    "text": "Еще более пугающим является тот факт, что эти болезни не обязательно проявляются сразу. Иногда симптомы никак не обнаруживают себя долгие годы. За это счастливое время собака становится любимым членом семьи и важной частью вашей жизни, которую внезапная болезнь разрушит, причинив всем еще большую боль."
                },
                {
                    "type": "paragraph",
                    "text": "Эмоциональный ущерб, который неизбежно наносит болезнь питомца, неисчислим, поэтому подобный способ сэкономить – это самое безответственное, неэтичное и во всех смыслах невыгодное решение, которое только может принять потенциальный хозяин. Помните, что у более высокой цены существуют свои основания, игнорировать которые неправильно и неразумно."
                },
                {
                    "type": "title",
                    "text": "Поведение"
                },
                {
                    "type": "paragraph",
                    "text": "Непрофессиональный уход за щенком на ранних этапах может привести к пожизненным трудностям как для собаки, так и для ее владельца. В первые месяцы жизни щенку необходимо правильно социализироваться, научиться взаимодействовать с матерью, братьями и сестрами. Слишком ранняя разлука с семьей, а также недостаточный уровень социализации или общего развития, будут тормозить эмоциональный рост и могут привести к таким серьезным поведенческим отклонениям, как крайняя застенчивость, бесконечная агрессия и пожизненная тревога. Щенкам из ненадежного источника адаптироваться в новой семье намного сложнее, они с большей вероятностью могут остаться изолированными и одинокими на всю жизнь."
                },
                {
                    "type": "title",
                    "text": "Благополучие животных"
                },
                {
                    "type": "paragraph",
                    "text": "Собачьи фермы – это коммерческие проекты, созданные с единственной целью получения прибыли. Такие организации относятся к животным исключительно как к средству достижения собственных финансовых целей."
                },
                {
                    "type": "paragraph",
                    "text": "Собаки содержатся в ужасных условиях: часто они помещены в тесные клетки и полностью лишены надлежащего ветеринарного ухода до тех пор, пока полностью не теряют физическую способность к размножению. Когда это происходит, ослабленные собаки нередко оказываются брошенными, и это трагедия, предотвратить которую может только подготовленный, благоразумный и внимательный покупатель, осознающий свою ответственность не только перед своим будущим щенком, но и перед другими собаками, страдающими в подобных условиях."
                },
                {
                    "type": "paragraph",
                    "text": "Ненадежные заводчики не рассматривают собак как живых существ, поэтому для них нет никакого стимула помогать щенкам социализироваться, оказывать надлежащую медицинскую помощь или поддерживать и консультировать их новых неопытных владельцев, что часто приводит к отказу от питомца."
                },
                {
                    "type": "paragraph",
                    "text": "Важнейшая миссия Petman состоит в том, чтобы объединить будущих хозяев и проверенных ответственных заводчиков, чтобы вместе они смогли дать каждой собаке то, в чем она нуждается, - необходимый уход, заботу и любовь. "
                }
            ]
        },
        {
            "id": "8",
            "title1": "Это вам не игрушки: этика разведения и приобретения миниатюрных пород.",
            "subTitle": "Милая, на первый взгляд, но в действительности серьезная и тревожная тенденция разведения и приобретения аномально маленьких собак.",
            "img": "./assets/img/articales/img/articles-details/статья8_биг.jpg",
            "body": [
                {
                    "type": "paragraph",
                    "text": "В течение последнего десятилетия довольно отчетливо прослеживается тренд на приобретение так называемых \"чайных\" собачек (от анг. «teacup» dogs), в значительной степени обязанных своей популярностью знаменитостям и социальным сетям. Идея иметь ”карманную” версию своей любимой породы кажется привлекательной все большему количеству людей. Однако, не многие знают, что подобная миниатюризация собак – процесс неестественный, и эта забавная трансформация негативно сказывается на здоровье собаки. Действительно, в природе просто не существует собаки  \"размером с чайную чашку\", но безответственные заводчики готовы прибегать к неэтичным и опасным методам в стремлении сделать своих собак как можно меньше, а собственную прибыль, напротив, как можно больше."
                },
                {
                    "type": "paragraph",
                    "text": "Общий подход, используемый неэтичными заводчиками, состоит в том, чтобы взять самую маленькую собаку из помета или собаку, которая аномально мала по причине медицинского отклонения или врожденного дефекта, и вывести их потомство. Такой способ небезопасен и может повлечь за собой множество серьезных рисков для здоровья этих чрезвычайно маленьких собак."
                },
                {
                    "type": "paragraph",
                    "text": "Однако безответственные заводчики готовы поставить под угрозу здоровье своих питомцев из-за высокой стоимости таких «чайных» собачек. Существует мнение, что миниатюрные породы склонны к наследственным проблемам со здоровьем, включая врожденные дефекты, которые могут никак не проявлять себя в течение длительного времени или даже всей жизни собаки. Но все же каждый раз, когда эти неестественно маленькие и нездоровые собаки размножаются, проблемы со здоровьем неизбежно передаются их щенкам и, в конечном итоге, все равно выявляются."
                },
                {
                    "type": "paragraph",
                    "text": "Нередко миниатюрные породы испытывают пожизненные проблемы со здоровьем общего характера. Это могут быть пороки сердца, проблемы с дыханием, нарушения работы различных органов, судороги, проблемы с пищеварением, слепота, проблемы с зубами и деснами."
                },
                {
                    "type": "paragraph",
                    "text": "Именно из-за своего размера такие собаки очень уязвимы. Отсутствие еды может привести к судорогам или смерти из-за низкого уровня сахара в крови. Кости же настолько малы и хрупки, что падение даже с самой небольшой высоты может привести к серьезной травме. Безобидная игра с более крупной собакой может также нанести непоправимый вред собаке такого маленького роста."
                },
                {
                    "type": "paragraph",
                    "text": "В чрезвычайной ситуации оперировать и лечить миниатюрные породы невероятно трудно – к сожалению, не многих заводчиков волнует, что вместе с размером собаки уменьшаются и шансы на ее спасение. Работа ветеринаров осложняется еще и наличием проблем с уровнем сахара в крови и поддержанием необходимой температуры тела, которые наблюдаются у большинства представителей миниатюрных пород. Из-за этих отклонений анестезия может быть очень опасной для этих животных, поэтому любая операция – это всегда угроза их жизни."
                },
                {
                    "type": "paragraph",
                    "text": "Важно обозначить различия между двумя видами миниатюрных собак – «игрушечными» (от анг. «toy» group) и уже упомянутыми «чайными». Породы первой группы официально признаны большинством кинологических федераций мира и широко распространены по всему миру, потому как их небольшой размер - это естественная особенность вида, а их разведение осуществляются этичными и безопасными методами без нанесения какого-либо вреда здоровью. А вот собак второй “чайной” группы формально вовсе не существует. Однако в действительности противоестественные миниатюрные версии самых разных крупных пород, являющиеся по сути жертвами неэтичных экспериментальных методов разведения, продолжают выставляться на продажу за огромные деньги."
                },
                {
                    "type": "paragraph",
                    "text": "Термин \"чайная чашка\" используется в основном заводчиками и зоомагазинами в рекламных целях. Для поддержания популярности аномально маленьких собак, размер которых на самом деле является следствием серьезных проблем со здоровьем, заводчики увеличивают ценник в несколько раз, превращая дефект в привилегированную отличительную особенность – размер чайной чашки. Вот почему важно знать, что почти каждый заводчик, утверждающий, что у него есть собаки нестандартного миниатюрного размера, скорее всего, прибегает к неэтичным методам разведения или же просто пытается обмануть клиентов."
                },
                {
                    "type": "paragraph",
                    "text": "Тенденция разведения экспериментальных миниатюрных пород, которую, к сожалению, все чаще предпочитают выбору здоровых собак естественного размера, закономерно влечет за собой множество проблем со здоровьем таких необычных щенков. Приобретение такой оригинальной крошечной собаки может показаться просто милой и забавной идеей, однако выбор одного из таких щенков означает поддержку хозяином неэтичных методов разведения и оправдание тяжелых наследственных и ненаследственных физических дефектов и отклонений разной степени тяжести, с которыми многие из этих собак живут на протяжении всей своей недолгой жизни."
                },
                {
                    "type": "paragraph",
                    "text": "Если вы все же хотите приобрести для себя миниатюрную собаку, сделайте выбор в пользу щенка одной из официально признанных пород и ответственного профессионального заводчика, для которого главным приоритетом всегда остается здоровье и благополучие животных. Так вы не разобьете ваше большое сердце и крохотное сердце вашего нового питомца. Своим решением вы также поддержите заводчика, который ставит благополучие животных превыше всего — на шаг приближая нас к отказу от опасных неэтичных подходов и построению лучшего, более здорового и безопасного мира для наших собак."
                }
            ]
        },
        {
            "id": "9",
            "title1": "Почему важно работать с проверенным заводчиком",
            "subTitle": "Опыт заводчика оказывает огромное влияние на состояние здоровье, формирование темперамента и общее благополучие вашего будущего щенка.",
            "img": "./assets/img/articales/img/articles-details/статья9_биг.jpg",
            "body": [
                {
                    "type": "paragraph",
                    "text": "Выбор нового питомца – это прекрасный, захватывающий, но, вместе с тем, сложный и порой пугающий процесс. Когда вы рассматриваете возможность взять собаку в свою семью, на самом деле вы готовитесь принять на себя большое и крайне серьезное обязательство. Это действительно важное решение, поэтому вы должны быть уверены, что заводчик, с которым вы сотрудничаете, будет профессионален, внимателен и вложит в вашего будущего питомца не меньше усилий, чем вы сами."
                },
                {
                    "type": "paragraph",
                    "text": "Отношения между заводчиком и потенциальным владельцем собаки полностью построены на доверии. И, к сожалению, мы знаем слишком много историй о том, что происходит, когда это доверие рушится. Многие люди, в конечном итоге, отказываются от мечты взять щенка лишь потому, что не смогли найти надежный питомник, взаимодействуя с которым, они чувствовали бы себя комфортно. Другим приходилось принимать еще более трудное решение – отказ от щенка, когда у него внезапно обнаруживались серьезные проблемы со здоровьем или нарушения в поведении, исправить которые сложно или даже невозможно вовсе."
                },
                {
                    "type": "paragraph",
                    "text": "В Petman мы уделяем большое внимание соответствию каждого заводчика высоким профессиональным требованиям с целью создать надежные доверительные отношения на протяжении всего процесса выбора и приобретения щенка. Совместно с экспертами мы разработали и утвердили четкие стандарты, которые гарантируют, что заводчики на нашей платформе заботятся о благополучии своих животных."
                },
                {
                    "type": "paragraph",
                    "text": "В уважаемом питомнике собаки-родители всегда проверяются на наличие как незначительных, так и серьезных наследственных заболеваний. Такие ответственные заводчики также обеспечивают щенкам все необходимые прививки, анализы и другие медицинские процедуры в раннем возрасте."
                },
                {
                    "type": "paragraph",
                    "text": "Щенок из надежного источника также будет социализирован и подготовлен к взаимодействию с внешним миром на самых ранних стадиях развития. Такие щенки полностью готовы к комфортному перемещению в свой новый дом, они значительно быстрее адаптируются в стрессовых условиях."
                },
                {
                    "type": "paragraph",
                    "text": "Все просто: выбор проверенного заводчика - лучший способ обеспечить долгую и счастливую жизнь с вашей новой собакой. Будьте внимательны. "
                }
            ]
        },
        {
            "id": "10",
            "title1": "Как выбрать правильного заводчика?",
            "subTitle": "Неопытному покупателю процесс поиска подходящего заводчика может показаться сложным и запутанным. В этой статье мы собрали несколько полезных советов для будущего владельца.",
            "img": "./assets/img/articales/img/articles-details/статья10.jpg",
            "body": [
                {
                    "type": "paragraph",
                    "text": "Поиск подходящего заводчика не должен превращаться в утомительный процесс. Выбор нового члена семьи - это очень эмоциональный и, в то же время, важный путь, в котором каждый шаг вы делаете со всей ответственностью и серьёзностью. Но все же вы не должны испытывать чувство страха во время общения с заводчиками."
                },
                {
                    "type": "paragraph",
                    "text": "Определившись с породой собаки, вы можете приступать к поиску идеального питомника. Все заводчики Petman — это авторитетные профессионалы, полностью соответствующие высоким требованиям нашей площадки, поэтому вы можете принимать спокойное и уверенное решение, основываясь на критериях, важных именно для вас."
                },
                {
                    "type": "paragraph",
                    "text": "Некоторые люди предпочитают работать с местными заводчиками, но это совсем не означает, что вам нужно поступать так же.  Конечно, в выборе местного заводчика есть свои преимущества, но такое территориальное ограничение может затруднить поиск идеального щенка для вашей семьи. Кроме того, в настоящее время есть много безопасных и удобных вариантов транспортировки вашего питомца домой, поэтому не стесняйтесь искать щенка на больших расстояниях."
                },
                {
                    "type": "paragraph",
                    "text": "Далее рассмотрим весь процесс приобретения собаки у заводчика. Существуют списки ожидания, депозиты и процесс отлучения от матери, через который ваш щенок должен пройти, прежде чем он сможет оказаться в своём новом доме. Каждый заводчик привык работать по-своему, поэтому обратите внимание на его характеристики и уточните все детали в личном общении до того, как вы примете финальное решение."
                },
                {
                    "type": "paragraph",
                    "text": "Например, некоторые заводчики отдают щенков только в руки хозяев, а это означает, что вам придется самостоятельно добраться до питомника, чтобы забрать вашего щенка. Другие заводчики предоставляют варианты перевозки щенка в сопровождении няни или же грузовым рейсом. Таких деталей может быть очень много и, в конечном итоге, именно они будут влиять на формирование вашего финального решения. Вот почему так важно сразу изучить все условия того или иного питомника."
                },
                {
                    "type": "paragraph",
                    "text": "Наконец, в процессе личного общения составьте представление о личности, опыте и позиции вашего заводчика. Не стесняйтесь поговорить с несколькими кандидатам , прежде чем сделать окончательный выбор — они являются экспертами и также хотят найти лучший дом для своих щенков, поэтому с удовольствием проконсультируют вас по всем вопросам. Ваше сотрудничество с заводчиком будет длиться не менее трех месяцев, и вы должны чувствовать себя в этих отношениях комфортно и уверенно."
                }
            ]
        },
        {
            "id": "11",
            "title1": "Что вас ждет после подачи заявки на щенка",
            "subTitle": "Заводчики относятся к каждой своей собаке, как к полноценному члену семьи, поэтому для них действительно важно найти хороший дом для своих щенков. В процессе общения с вами заводчики хотят убедиться, что вы сможете дать вашему питомцу уход, заботу и любовь, в которых он так нуждается.",
            "img": "./assets/img/articales/img/articles-details/статья11_биг.jpg",
            "body": [
                {
                    "type": "paragraph",
                    "text": "После того, как вы, наконец, нашли для себя подходящего заводчика, вам предстоит пройти несколько важных этапов отбора, некоторые из которых могут показаться вам странными и неожиданными, если вы никогда раньше не сотрудничали с питомниками."
                },
                {
                    "type": "paragraph",
                    "text": "Задача каждого заводчика — следить за тем, чтобы его щенки попадали в лучшие дома, к ответственным, заботливым и любящим владельцам. Такой подход отличает профессиональных заводчиков от неэтичных перекупщиков и сомнительных организаций."
                },
                {
                    "type": "paragraph",
                    "text": "Несмотря на то, что каждый заводчик по-своему организовывает процесс отбора потенциальных покупателей, как правило, всегда можно ожидать некоторых общих моментов."
                },
                {
                    "type": "title",
                    "text": "Предварительное интервью"
                },
                {
                    "type": "paragraph",
                    "text": "Многие заводчики попросят вас ответить на несколько стандартных вопросов, прежде чем вступить с вами в диалог. Petman упрощает этот процесс, позволяя просто и быстро заполнить заявку любому заводчику на нашей платформе. Но будьте готовы к тому, что некоторые заводчики захотят задать вам несколько дополнительных вопросов."
                },
                {
                    "type": "paragraph",
                    "text": "Главная цель интервью — понять, сможете ли вы стать хорошим хозяином для собаки. Вот список самых популярных вопросов, интересующих заводчика:"
                },
                {
                    "type": "paragraph",
                    "text": "Место проживания. Эта информация поможет определить, живете ли вы городских или пригородных условиях, и как эти условия соотносятся с породой собаки, к которой вы проявляете интерес."
                },
                {
                    "type": "paragraph",
                    "text": "Размер вашего дома и любые соответствующие детали. «Вы живете в квартире или собственном доме?»; «Сколько у вас комнат и какова общая площадь?»; «Ваш хозяин разрешает животных?»... Важно понимать, что вашему потенциальному щенку потребуется достаточно места для роста, обучения и различных активностей, поэтому заводчики хотят убедиться, что вы сможете предоставить питомцу все необходимые условия."
                },
                {
                    "type": "paragraph",
                    "text": "Ваш график работы. Этот вопрос будет особенно важен, когда ваш щенок впервые окажется в своём новом доме и будет требовать от своего хозяина много внимания и сил. Заводчики хотят узнать, сколько времени вы сможете проводить со своей новой собакой на самом деле. Если ваш график работы не позволяет вам находиться дома в течение всего дня, будьте готовы составить план по уходу за щенком."
                },
                {
                    "type": "paragraph",
                    "text": "Опыт владения собаками или другими домашними животными. Эти вопросы раскроют ваши практические навыки ухода за животными, и позволят заводчику понять степень вашей осознанности и общее умение общаться с питомцами."
                },
                {
                    "type": "paragraph",
                    "text": "По каким причинам вы решили завести собаку? Возможно, вы хотите собаку просто для приятного общения, а, может, вам важно, чтобы ваш ребенок приобрел нового друга или научился ответственности. Собака - это не аксессуар, не гаджет и не игрушка для вашего ребёнка, поэтому заводчики хотят знать ваши истинные намерения и приоритеты."
                },
                {
                    "type": "paragraph",
                    "text": "Есть ли у вас дети? Заводчики всегда интересуются, сколько у вас детей и какого они возраста. Это связано с тем, что у щенков, попадающих в семью, в которой взрослые заняты заботой о детях и другими домашними обязанностями, может быть меньше шансов получить время и внимание, в которых они нуждаются. Эта информация также может помочь заводчику определить, какой щенок из его предстоящего помета лучше подойдет именно для вашей семьи."
                },
                {
                    "type": "paragraph",
                    "text": "Как вы планируете обучать собаку? Важно, чтобы новые владельцы в полной мере понимали все, что от них потребуется. Например, вы уже знаете, где будет спать ваша собака? А о месте для игр уже подумали? Будете ли вы записывать питомца на групповые занятия или договоритесь об индивидуальной консультации с тренером? Продумайте все детали ухода за своей новой собакой, прежде чем подавать заявку на ее покупку."
                },
                {
                    "type": "paragraph",
                    "text": "Готовы ли вы к собаке с финансовой точки зрения? Прежде всего, необходимо понимать, что уход за питомцем - это долгосрочное обязательство. Заводчики захотят узнать, можете ли вы позволить себе не просто купить собаку, но обеспечивать ее должным образом на протяжении всей жизни."
                },
                {
                    "type": "paragraph",
                    "text": "Это наиболее распространенные вопросы, которые заводчики, как правило, задают своим потенциальным покупателям. Такое интервью поможет им определить, какая собака вам больше подходит, конечно, если они не считают, что вы еще не готовы стать хорошим хозяином для питомца."
                },
                {
                    "type": "paragraph",
                    "text": "Заводчики также обязательно спросят о ваших собственных предпочтениях. На данном этапе  в питомнике может не быть щенка, который был бы готов отправиться в новый дом прямо сейчас, или же список ожидания окажется заполнен. Тем не менее, заводчик захочет узнать, какого размера, окраски и темперамента питомца вы ищете, поскольку профессионалы всегда принимают это во внимание, помогая вам найти идеальную собаку."
                }
            ]
        },
        {
            "id": "12",
            "title1": "Почему некоторые заводчики предпочитают купировать (или не купировать) хвосты своим собакам.",
            "subTitle": "Узнайте немного об истории купирования хвостов, чтобы лучше понять современные реалии.",
            "img": "./assets/img/articales/img/articles-details/статья12_биг.jpg",
            "body": [
                {
                    "type": "paragraph",
                    "text": "Вы когда-нибудь задумывались о том, почему у некоторых собак хвосты намного короче, чем у других? Помимо разницы в непосредственных размерах пород, некоторые заводчики купируют хвосты своим питомцам или, другими словами, удаляют им часть хвоста хирургическим путем."
                },
                {
                    "type": "paragraph",
                    "text": "Эта практика впервые встречается еще во времена Римской империи, однако настоящую популярность она приобрела уже в Викторианскую эпоху. Люди хотели, чтобы их собаки выглядели определенным образом, и поэтому прибегали к этой «косметической» операции."
                },
                {
                    "type": "paragraph",
                    "text": "В настоящее время существует 62 официально признанные породы собак, имеющих купированные хвосты. К ним относятся кокер-спаниели, ротвейлеры и йоркширские терьеры. Часто процедуру купирования хвоста связывают с охотничьими породами собак. Также некоторые породы являются обладателями очень коротких хвостов от природы (например, старая английская овчарка и австралийская овчарка)."
                },
                {
                    "type": "paragraph",
                    "text": "Согласно мнению экспертов, можно выделить три основные исторические причины купирования хвостов. Во-первых, древние римляне считали, что отрезание части хвоста может предотвратить бешенство. Люди более низкого класса, владевшие охотничьими собаками, были обязаны купировать хвосты своих собак, потому что в противном случае им просто запрещалось охотиться. Также считалось, что купирование хвостов рабочих и охотничьих собак предотвратит травму во время различных видов деятельности с высокой интенсивностью. Например, терьеров с купированным хвостом хозяину было намного легче вытащить из норы, в которую они часто залезали вслед за животным."
                },
                {
                    "type": "paragraph",
                    "text": "Сегодня, когда роль собак в значительной степени трансформировалась, необходимость в купировании хвостов также начала постепенно претерпевать изменения. Сегодня эта процедура стала считаться совершенно ненужной, более того, нет никаких доказательств, что купирование хвоста на самом деле предотвращает возможные травмы."
                },
                {
                    "type": "paragraph",
                    "text": "Поскольку не было доказано, что купирование хвостов может оказывать какое-либо влияние на чувство достоинства или гордости собак за свой внешний вид (что является наиболее популярными причинами косметических процедур для людей), нет никакой очевидной пользы в выполнении этой процедуры для самих питомцев. Единственное преимущество, которое, по-видимому, вытекает из косметического купирования хвостов, - это положительное впечатление владельца о приятной внешности своего любимца."
                },
                {
                    "type": "paragraph",
                    "text": "Практика купирования хвостов даже стала запрещенной в некоторых странах мира по этическим соображениям. Эта косметическая процедура не оказывает реального влияния на предотвращение травм или “самооценку” собаки, а значит, она влияет только на ее внешний вид в глазах человека. Некоторые заводчики, которые не заинтересованы в разведении или продаже собак выставочного класса, предпочтут не прибегать к процедуре купирования хвостов своих собак. Если же планируется, что щенок будет принимать участие в различных соревнованиях, купирование может стать необходимым. Также существует новое альтернативное мнение, доказывающее, что купированный хвост может вносить затруднения в процесс взаимодействия между собаками."
                },
                {
                    "type": "paragraph",
                    "text": "В конце концов, заводчики или владельцы могут самостоятельно принять решение о необходимости купирования хвостов, в зависимости от того, хотят ли они, чтобы их щенок соответствовал различным принятым стандартам своей породы. И все же большинство экспертов сходятся во мнении, что купирование хвоста – это косметическая и, в конечном счете, совершенно ненужная процедура."
                }
            ]
        },
        {
            "id": "13",
            "title1": "В конце концов, заводчики или владельцы могут самостоятельно принять решение о необходимости купирования хвостов, в зависимости от того, хотят ли они, чтобы их щенок соответствовал различным принятым стандартам своей породы. И все же большинство экспертов сходятся во мнении, что купирование хвоста – это косметическая и, в конечном счете, совершенно ненужная процедура.",
            "subTitle": "О чем нужно непременно подумать, если вы хотите забрать собаку из приюта в семью с детьми, и как понять, какой питомец подойдет именно вам.",
            "img": "./assets/img/articales/img/articles-details/статья13_биг.jpg",
            "body": [
                {
                    "type": "title",
                    "text": "Возраст"
                },
                {
                    "type": "paragraph",
                    "text": "Выбор возраста вашего будущего питомца – достаточно сложное и очень важное решение, которое должно основываться, в первую очередь, на ваших ожиданиях в отношении поведения собаки. Например, щенки игривы и полны энергии, однако сможете ли вы уделить им достаточно времени и внимания? Взрослые же собаки, напротив, могут быть более спокойными и независимыми, но некоторым из них может непросто адаптироваться к ритму жизни семьи с  маленькими детьми."
                },
                {
                    "type": "paragraph",
                    "text": "Большинство приютов всегда предоставляют информацию о темпераменте каждой собаки и, в частности, о том, ладит ли она с детьми. Некоторые животные могут иметь негативный опыт общения с детьми и будут менее восприимчивы к их вниманию. Другие же, возможно, всегда жили с детьми и прекрасно ладили с ними. Обязательно задайте все волнующие вас вопросы работникам приюта или даже попробуйте организовать встречу вашего ребенка с собакой в безопасной обстановке, прежде чем согласиться взять в семью нового питомца."
                },
                {
                    "type": "paragraph",
                    "text": "Если вы готовитесь забрать из приюта щенка, помните, что уход за ним потребует от вас действительно серьезных усилий. Появление в доме щенка можно сравнить с присутствием в семье маленького ребенка, поэтому будьте готовы к тому, что ему потребуется больше вашей энергии и внимания, чем вы, возможно, думаете."
                },
                {
                    "type": "paragraph",
                    "text": "Также щенки очень ранимы, подумайте о том, что именно в вашей семье питомец впервые узнает, как устроен мир. Дети не всегда понимают, как правильно обращаться со взрослыми собаками, не говоря уже о еще более беззащитных щенках. Обязательно объясните детям, каким образом им нужно будет вести себя с новым членом семьи, особенно если это щенок или миниатюрная порода, и будьте готовы нести ответственность не только за свои действия, но и за поступки ваших детей."
                },
                {
                    "type": "title",
                    "text": "Размер"
                },
                {
                    "type": "paragraph",
                    "text": "Наверное, все мы хоть раз смеялись над милыми и забавными роликами, в которых взрослая собака случайно сбивает малыша хвостом или сидит на ребенке, не замечая этого. Но на самом деле, действительно важно учитывать размер собаки, принимая во внимание возраст детей в вашем доме."
                },
                {
                    "type": "paragraph",
                    "text": "При правильном обучении любая собака может научиться быть спокойной и послушной, даже рядом с детьми. Но все же взаимодействие очень больших собак с маленькими детьми может быть чуть более рискованным просто из-за их размера, в то время как собаки поменьше не будут иметь этого небезопасного превосходства в массе и силе. Однако зачастую они сами могут оказаться в большей опасности."
                },
                {
                    "type": "paragraph",
                    "text": "Мы не сможем порекомендовать конкретный идеальный размер питомца для семьи с ребенком, так как его просто не существует. Поэтому вам стоит обсудить вашу уникальную ситуацию с приютом и попросить помощи в поиске подходящего размера собаки для вас."
                },
                {
                    "type": "title",
                    "text": "Темперамент"
                },
                {
                    "type": "paragraph",
                    "text": "Когда речь заходит о детях, все сводится именно к темпераменту определенной собаки. Обсудите особенности поведения и личности собаки с сотрудником вашего приюта, обязательно уточните, был ли у животного опыт общения с детьми прежде. Конечно, информация может быть неполной, если приют не знает историю собаки, а поведение некоторых питомцев может различаться в зависимости от обстоятельств, поэтому о каких-либо гарантиях в этой ситуации говорить, разумеется, нельзя."
                },
                {
                    "type": "title",
                    "text": "Ответственность"
                },
                {
                    "type": "paragraph",
                    "text": "В обществе существует довольно популярная установка, что щенков часто дарят детям, чтобы те постепенно учились о ком-то заботиться, то есть больше в воспитательных целях. Если вы также приобретаете собаку с единственной целью научить вашего ребенка быть ответственным, будьте готовы взять на себя все наиболее значимые и сложные обязательства по уходу за животным и стать, прежде всего, хорошим примером для своих детей. Вы должны помнить, что собака - это не очередная игрушка для вашего ребенка, но большая ответственность для вас."
                },
                {
                    "type": "paragraph",
                    "text": "Уход за собакой требует много времени, энергии и ресурсов - все это не должно и не может исходить от ребенка. Конечно, питомец в семье – это отличный способ для ребенка играть на открытом воздухе, гулять, завести преданного друга, научиться соблюдать распорядок и быть ответственным. Но, в конце концов, только взрослый человек способен отвечать за состояние здоровья и правильное обучение вашей собаки, поэтому убедитесь, что у вас действительно есть время, которые вы можете посвятить питомцу, возможно, частично забирая его у своей семьи и детей."
                }
            ]
        },
        {
            "id": "14",
            "title1": "Вопрос жизни и жизни: что нужно учитывать, если вы решили взять собаку из приюта",
            "subTitle": "Каждая собака уникальна, поэтому, прежде чем определиться с выбором, подумайте о факторах, которые могли бы построить или, наоборот, разрушить долгие и счастливые отношения с вашим будущим питомцем.",
            "img": "./assets/img/articales/img/articles-details/статья14_биг.jpg",
            "body": [
                {
                    "type": "paragraph",
                    "text": "Если вы приняли решение, забрать собаку из приюта, особенно важно открыто и честно обозначить ваши настоящие ожидания и потребности. Подумайте о том, какая собака подойдет для вашего образа жизни, выявите свои предпочтения относительно размера, темперамента и прочих характеристик."
                },
                {
                    "type": "paragraph",
                    "text": "Вы привыкли к размеренному образу жизни и хотели бы найти себе более спокойного и самостоятельного питомца? А, может быть, для вас важно, чтобы новый щенок был хорошо социализирован и чувствовал себя комфортно в обществе других ваших домашних животных? А что насчет вашего дома - он подойдет для собаки крупной породы или лучше выбрать более миниатюрного питомца?  "
                },
                {
                    "type": "paragraph",
                    "text": "Это лишь примеры вопросов, которые вы должны задать сами себе, чтобы обдумать и проанализировать все важные факторы. Щенок должен идеально подходить вам по всем значимым параметрам, потому что именно отсутствие этой особой связи и взаимопонимания между хозяином и питомцем становится, в конце концов, главной причиной, по которой животное обычно оказывается в приюте."
                },
                {
                    "type": "title",
                    "text": "Размер"
                },
                {
                    "type": "paragraph",
                    "text": "Выбирая размер вашей будущей собаки, прежде всего, подумайте о параметрах жилой площади, которую вы сможете ей предоставить. Если вы живете в доме на собственном участке, вы действительно можете подумать о крупной породе, но, если пока вы располагаете лишь небольшой площадью в многоквартирном доме, вам наверняка лучше подойдет более миниатюрный друг."
                },
                {
                    "type": "paragraph",
                    "text": "Спасательные организации и приюты не всегда могут предугадать окончательный размер собаки, поскольку они, скорее всего, не знают ее родителей и родословную. Однако, они наверняка смогут дать вам достоверную приблизительную информацию, которой будет вполне достаточно для принятия решения."
                },
                {
                    "type": "title",
                    "text": "Уровень энергии"
                },
                {
                    "type": "paragraph",
                    "text": "Одни собаки требуют больше упражнений и активности, чем другие, и это абсолютно естественно. Подумайте, что вы сможете предоставить питомцу на основе вашего образа жизни. Вы часто ходите на пробежки или вы более спокойный и домашний человек? Готовы ли вы обеспечить собаке необходимые упражнения и уровень активности, в котором она нуждается регулярно? "
                },
                {
                    "type": "paragraph",
                    "text": "Энергичность собаки должна соответствовать возможностям, которые вы действительно сможете ей дать. В противном случае, ваша совместная жизнь может стать практически невозможной, что может привести к повторному возвращению собаки в приют."
                },
                {
                    "type": "title",
                    "text": "Темперамент"
                },
                {
                    "type": "paragraph",
                    "text": "Характер каждого животного уникален, поэтому разные собаки могут вести себя совершенно по-разному. Если раньше у вас уже был питомец, и вы ожидаете, что ваш новый друг из приюта будет во многом похож на него, скорее всего, вас ждет разочарование."
                },
                {
                    "type": "paragraph",
                    "text": "Некоторые собаки игривы и привязчивы, в то время как другие могут быть более спокойными и независимыми. Это не означает, что ваша собака не может сочетать в себе несколько разных аспектов, но все же вы должны иметь четкое представление о подходящем вам темпераменте, прежде чем сделать свой выбор."
                },
                {
                    "type": "paragraph",
                    "text": "Конечно, нужно помнить о том, что со временем поведение собаки может быть скорректировано в лучшую сторону при правильном обучении и социализации. Однако этот процесс может быть очень трудоемким, продолжительным и дорогостоящим, поэтому вы должны быть уверены, что готовы взять на себя такую ответственность."
                },
                {
                    "type": "paragraph",
                    "text": "Приюты и спасательные организации смогут предложить вам широкий выбор пород, размеров и, что наиболее важно, самых разных характеров, поэтому подойдите к выбору со всей ответственностью, чтобы избежать возможных печальных последствий. Будьте честны, прежде всего, с собой и четко объясните свои предпочтения работникам приюта. Тогда они наверняка смогут подобрать для вас правильного щенка и настоящего друга."
                }
            ]
        },
        {
            "id": "15",
            "title1": "Способы транспортировки щенка от заводчика",
            "subTitle": "Если вам нужна помощь с доставкой щенка от заводчика, напишите нам в",
            "intercom": "чат поддержки",
            "img": "./assets/img/articales/img/articles-details/статья15_биг.jpg",
            "body": [

                {
                    "type": "paragraph",
                    "text": "Итак, вы справились! Идеальный заводчик найден, дом тщательно подготовлен к приезду нового члена семьи, а ветеринар уже ждет вас на первичный осмотр. Долгожданная встреча произойдет совсем скоро, а пока в вашем списке дел остался всего один, но очень важный пункт – транспортировка щенка в новый дом. "
                },
                {
                    "type": "paragraph",
                    "text": "Зачастую удается найти подходящего заводчика где-то в автомобильной доступности от дома. В этом случае смело поезжайте в питомник, знакомьтесь с новым другом и возвращайтесь домой вместе"
                },
                {
                    "type": "paragraph",
                    "text": "Однако идеальный питомник далеко не всегда находится поблизости. Бывают случаи, когда щенок мечты находится в другом городе, и у вас нет возможности лично приехать и забрать его. Это не повод отчаиваться, ведь в современном мире существует сразу несколько способов привезти питомца к вам домой:"
                },
                {
                    "type": "paragraph",
                    "text": "- Доставка самолетом/поездом/автомобилем в сопровождении специалиста"
                },
                {
                    "type": "paragraph",
                    "text": "- Авиаперевозка без сопровождения (карго)"
                },
                {
                    "type": "paragraph",
                    "text": "- Вы покупаете авиа/жд билеты до нужного города, а заводчик встречает вас в аэропорту/на вокзале"
                },
                {
                    "type": "paragraph",
                    "text": "Ваша главная задача – обеспечить комфортный и безопасный переезд для маленького любимца. Помните, что первое путешествие, как правило, сопровождается стрессом для животного, но в ваших силах свести его к минимуму. Все, что для этого нужно, – продумать оптимальный маршрут и план поездки. Давайте рассмотрим возможные варианты и подберем для вас наиболее подходящий."
                },
                {
                    "type": "title",
                    "text": "Забрать щенка самостоятельно"
                },
                {
                    "type": "paragraph",
                    "text": "Как мы уже писали, для заводчика в вашем или соседнем городе вполне подойдет автомобиль. Все, что вам нужно сделать — это правильно подготовиться к поездке в питомник и минимизировать шанс попасть в пробки. Список полезных вещей, которые стоит взять с собой, можно найти в другой нашей "
                },
                {
                    "type": "link",
                    "text": ""
                },
                {
                    "type": "paragraph",
                    "text": "Также, есть возможность забрать щенка самостоятельно даже если питомник находится в другом городе. Для этого вам нужно прилететь в соответствующий город и забрать щенка прямо в аэропорту. Большинство заводчиков готовы предоставить услугу доставки питомца до аэропорта своего города."
                },
                {
                    "type": "paragraph",
                    "text": "Если же город заводчика находится далеко или у вас нет своей машины, стоит воспользоваться поездом или самолетом. Заранее договоритесь с заводчиком и купите билеты в обе стороны с небольшим интервалом между ними. Когда вы прибудете в нужный пункт, вас уже будут ждать вместе с питомцем. Вы сможете подписать документы, осмотреть щенка, получить наставления от заводчика и сразу отправиться домой. Для длинных расстояний мы настоятельно рекомендуем выбирать самолет, так как долгая поездка (12+ часов) может плохо сказаться на самочувствии питомца, а вы не сможете оказать ему профессиональную помощь."
                },
                {
                    "type": "title",
                    "text": "Доставка от заводчика"
                },
                {
                    "type": "paragraph",
                    "text": "Большинство заводчиков готовы предоставить свою помощь с доставкой щенка. За свой многолетний опыт работы они, как правило, уже имеют налаженный процесс доставки щенков клиентам. Способ доставки будет варьироваться в зависимости от заводчика. Транспортировка щенка может быть осуществлена как самолетом, так и наземным транспортом, как с сопровождением специалиста, так и без. Условия доставки необходимо обсуждать индивидуально с каждым заводчиком. Доставка от заводчика может быть удобным способом, однако некоторые заводчики предоставляют ограниченный набор вариантов доставки, а некоторые и вовсе не занимаются этим."
                },
                {
                    "type": "title",
                    "text": "Доставка Petman"
                },
                {
                    "type": "paragraph",
                    "text": "Если вам нужна профессиональная помощь с доставкой, вы можете"
                },
                {
                    "type": "intercom1",
                    "text": ""
                },
                {
                    "type": "paragraph",
                    "text": "в Petman и мы организуем для вас безопасную и надежную транспортировку выбранного щенка. Наша основная специализация - доставка поездом на средние расстояния (200-500км), но при желании мы можем покрыть и другие расстояния, используя самолет или автомобиль. Наша доставка всегда происходит в сопровождении специалиста, который умеет работать с собаками (например, кинолога или профессионального догситтера), поэтому вы не будете переживать за сохранность вашего питомца."
                },
                {
                    "type": "paragraph",
                    "text": "Стоимость и сроки доставки рассчитываются индивидуально, в зависимости от удаленности городов и доступных билетов, сама поездка обычно занимает 1 день. "
                }
            ]
        },
        {
            "id": "16",
            "title1": "Что взять с собой, когда отправляетесь за щенком",
            "subTitle": "5 полезных вещей, которые вам необходимо захватить с собой, когда вы отправляетесь в путь за вашим новым другом.",
            "img": "./assets/img/articales/img/articles-details/статья16_биг.jpg",
            "body": [
                {
                    "type": "paragraph",
                    "text": "Ваша первая встреча с щенком, вероятно, будет одним из самых захватывающих и запоминающихся моментов в вашей жизни. Наконец, вы можете забрать своего питомца домой!"
                },
                {
                    "type": "paragraph",
                    "text": "Конечно, вы уже подготовили свой дом к прибытию нового члена семьи, но у нас есть для вас еще несколько рекомендаций о том, что нужно иметь под рукой, когда вы забираете свою собаку из питомника и перевозите ее в новый дом."
                },
                {
                    "type": "title",
                    "text": "1. Переноска "
                },
                {
                    "type": "paragraph",
                    "text": "Переноска необходима в том случае, когда вы летите с вашим щенком на самолете, или же если вы хотите, чтобы щенок был в полной безопасности во время поездки на автомобиле. Специальная переноска также предоставит вам возможность заниматься важными делами в дороге и быть уверенным в том, что ваш питомец под контролем."
                },
                {
                    "type": "title",
                    "text": "2. Ошейник и поводок"
                },
                {
                    "type": "paragraph",
                    "text": "Если вы не держите щенка на руках, вам точно понадобится удобный поводок, чтобы вы всегда могли контролировать питомца. Обсудите с заводчиком, какие именно ошейник и поводок лучше всего подойдут для щенка на первое время. Обычно рекомендуются нейлоновые ошейники, поскольку они мягче и удобнее для вашего щенка."
                },
                {
                    "type": "title",
                    "text": "3. Еда и угощения"
                },
                {
                    "type": "paragraph",
                    "text": "Обязательно захватите с собой лакомства и корм, так как ваш щенок, вероятно, проголодается за время длительного путешествия. Заводчик может предоставить специальный мешочек для корма, но об этом необходимо договориться заранее."
                },
                {
                    "type": "title",
                    "text": "4. Бумажные полотенца"
                },
                {
                    "type": "paragraph",
                    "text": "В дороге могут приключиться разные неприятности и ваш щенок, скорее всего, испачкается не один раз. Поэтому вам нужно непременно иметь при себе бумажные полотенца или салфетки, чтобы вовремя устранить любые недоразумения."
                },
                {
                    "type": "title",
                    "text": "5. Дополнительная пара рук "
                },
                {
                    "type": "paragraph",
                    "text": "Будет здорово, если вы сможете взять в вашу поездку за щенком друга или члена семьи, который сможет поддерживать вас и помогать, когда это потребуется. Например, ваш приятель сможет сфотографировать или снять на видео момент вашей первой встречи с щенком, вести машину и подменять вас на любых других важных задачах."
                },
                {
                    "type": "paragraph",
                    "text": "Не стесняйтесь задавать своему заводчику любые вопросы о всех необходимых щенку предметах, чтобы убедиться, что они подходят для его возраста и породы. Если вы что-то забыли – не страшно, в питомнике вам всегда смогут предоставить одеяло, игрушки и другие важные вещи, которые щенок захватит с собой в свой новый дом."
                },
                {
                    "type": "paragraph",
                    "text": "Некоторые люди формируют действительно длительные отношения со своими заводчиками. Вы можете поддерживать связь, отправляя фотографии или видео вашего щенка, а также рассказывая о его забавных проделках и достижениях. Если у вас появятся какие-либо вопросы, касающиеся воспитания, лечения или общего ухода за щенком, вы всегда можете проконсультироваться с заводчиком и получить необходимую помощь из надежного источника."
                }
            ]
        },
        {
            "id": "17",
            "title1": "Некоторые люди формируют действительно длительные отношения со своими заводчиками. Вы можете поддерживать связь, отправляя фотографии или видео вашего щенка, а также рассказывая о его забавных проделках и достижениях. Если у вас появятся какие-либо вопросы, касающиеся воспитания, лечения или общего ухода за щенком, вы всегда можете проконсультироваться с заводчиком и получить необходимую помощь из надежного источника.",
            "subTitle": "Поздравляем! Наконец, ваш щенок дома, и сегодня в вашей семье действительно большой день. Вот теперь-то начинается долгожданное веселье, но вы же не думаете, что будет легко, верно? ",
            "img": "./assets/img/articales/img/articles-details/статья17_биг.jpg",
            "body": [
                {
                    "type": "paragraph",
                    "text": "Первый месяц, который ваш новый щенок проведет дома, будет практически равномерно разделен на 3 основные категории: распорядок, терпение и игра. Впрочем, давайте рассмотрим их по отдельности одну за другой."
                },
                {
                    "type": "title",
                    "text": "Полюбите рутину"
                },
                {
                    "type": "paragraph",
                    "text": "Итак, приоритетная задача на этом этапе – адаптация щенка к образу жизни вашей семьи. Иными словами, ему необходимо поскорее привыкнуть к вашей домашней рутине. На этой стадии у собаки формируется общее представление о том, что такое «нормально» в этих новых для нее условиях – именно это понимание нормы как универсального порядка станет основой для будущего обучения."
                },
                {
                    "type": "paragraph",
                    "text": "В первую очередь, вам придется поработать над реорганизацией вашей ежедневной рутины, скорректировав свой распорядок в соответствии с потребностями вашего щенка. Например, ваш щенок не сможет отложить свои естественные нужды до того момента, пока вы не уговорите себя встать с кровати. Поэтому будьте готовы к нескольким слишком ранним или, напротив, слишком поздним прогулкам. Начните работать над формированием совместных привычек, определите время для ежедневных утренних и вечерних прогулок и четко следуйте новому распорядку, даже если количество незапланированных выходов давно превысило все мыслимые пределы."
                },
                {
                    "type": "paragraph",
                    "text": "В течение дня вашему щенку неоднократно потребуется выйти на улицу. Очень важно как можно быстрее избавиться от «эффекта неожиданности», место которого должна занять привычка. Начните привыкать к распорядку с первых дней - выводите питомца на прогулку столько раз, сколько потребуется, но строго через повторяющиеся промежутки времени (например, через 10 минут после еды или питья). Со временем эти интервалы будут увеличиваться, а количество необходимых прогулок – уменьшаться, но сейчас важно, чтобы щенок понимал, что любое действие повторяется регулярно и что привычный порядок не будет нарушен. Это знание станет основой его комфорта и спокойствия в новом доме."
                },
                {
                    "type": "paragraph",
                    "text": "Будьте готовы к посещению учебно-дрессировочных занятий в самом ближайшем будущем. Освоение щенком базовых навыков сделает вашу жизнь проще и обеспечит семье чувство безопасности и уверенности. Но не забывайте: школа – это не только групповые занятия с тренером, но и самостоятельная работа, обеспечивающая закрепление приобретенных навыков. Сделайте домашнюю практику частью повседневной рутины – это не только ускорит обучение, но и даст вашему щенку понимание некоторой структуры."
                },
                {
                    "type": "paragraph",
                    "text": "В первый месяц совместной жизни с вашим новым другом нужно особенно внимательно следить за его здоровьем. Запланируйте несколько визитов к ветеринару – первоначальный осмотр, прохождение плановых обследований и процедур, рекомендованных врачом, и профилактический визит в конце месяца. Собака должна привыкнуть к незнакомому пространству ветеринарного кабинета как можно раньше, чтобы в будущем посещения врача не сопровождалось стрессом и вызванными им поведенческими отклонениями."
                },
                {
                    "type": "title",
                    "text": "Учитесь быть терпеливым"
                },
                {
                    "type": "paragraph",
                    "text": "Поверьте, в первый месяц проживания в новом доме щенок предоставит вам достаточно возможностей для тренировки терпения. Покажите все, на что вы способны, ведь питомец не раз ошибочно примет вашу любимую пару обуви за свою новую жевательную игрушку, а вам придется с ним согласиться."
                },
                {
                    "type": "paragraph",
                    "text": "Трудно быть щенком! Каждый день наполнен открытиями и приключениями. Ваш питомец учится, растет и тратит столько энергии, что за ним почти невозможно угнаться. Абсолютно точно это будет непросто, но все же призываем вас изо всех сил стараться сохранять самообладание с вашим новым приятелем. Сейчас он действительно нуждается в спокойной и доброжелательной обстановке, нарушение которой только усилит стресс от переезда. Конечно, первое время неприятности будут происходить, но относиться к ним надо спокойно. Простите себя и своего щенка за любые ошибки, которые могут возникнуть, и помните, что любую из них всегда можно исправить, обратившись за помощью к профессионалу.."
                },
                {
                    "type": "paragraph",
                    "text": "Скорее всего, первым по-настоящему серьезным испытанием на вашем пути станет утомительный для всех членов вашей семьи процесс прорезывания зубов. Ваш щенок будет грызть, жевать и кусать больше, чем обычно, что совершенно нормально и понятно. И пока ваш питомец будет постепенно терять свои щенячьи зубы, вам, вполне вероятно, тоже придется расстаться с некоторыми вещами, которые покажутся вашему другу неожиданно увлекательными и аппетитными. Прорезывание зубов - это не весело, но почти наверняка преодолимо."
                },
                {
                    "type": "title",
                    "text": "Играйте в свое удовольствие"
                },
                {
                    "type": "paragraph",
                    "text": "Вы удивитесь, сколько энергии ваш щенок будет тратить каждый день. Очень важно регулярно выделять время и пространство для активных игр вашего щенка, ведь это – не просто веселое развлечение, но также комплекс физических упражнений, необходимый для полноценного и своевременного развития питомца. Именно в процессе игры собака обучается другим базовым формам поведения, приобретая ключевые навыки социального взаимодействия."
                },
                {
                    "type": "paragraph",
                    "text": "Ограничение в играх с большой вероятностью может отразиться на поведении собаки: проявление несвойственной прежде агрессии без видимых причин – признак переизбытка накопившейся энергии, которую питомец не смог растратить естественным путем. Кроме того, в процессе игры щенки отрабатывают различные социальные роли и модели поведения, поэтому, если питомец не имел возможности отработать основные поведенческие комплексы в игре, он инстинктивно моделирует ролевые паттерны в своем обычном поведении."
                },
                {
                    "type": "paragraph",
                    "text": "Взаимодействие с хозяином – одна из главных потребностей и, совершенно точно, любимое развлечение каждого щенка.  Вот почему очень важно, чтобы вы научились и полюбили играть со своим питомцем. Попробуйте использовать в игре специальные игрушки, направленные на совершенствование у собаки различных навыков, не забывайте про аппетитные жевательные лакомства, которые отлично подойдут в качестве поощрения и дополнительной мотивации."
                },
                {
                    "type": "paragraph",
                    "text": " Убедитесь, что ваш щенок проводит достаточно времени на свежем воздухе. Опыт исследования новых территорий и приобретение базовых навыков анализа окружающей среды – важный аспект развития щенка. Постарайтесь не ограничивать выход питомца на улицу только справлением его естественных нужд. Не спешите домой, попробуйте совершить пусть и не слишком продолжительную, но все же полноценную прогулку. Гуляние предоставит вашему щенку возможность общения с другими собаками и ускорит процесс социализации. Как можно чаще посещайте специальные площадки для выгула собак, а также парки и скверы с огороженной территорией, в которых ваш щенок сможет провести время на свежем воздухе без поводка, чтобы у него была возможность свободно выплеснуть накопившуюся энергию."
                },
                {
                    "type": "paragraph",
                    "text": "Помните, что здоровье и безопасность вашей собаки всегда должны быть на первом месте, поэтому постарайтесь не подвергать вашего питомца слишком интенсивным физическим нагрузкам. Не забывайте, что ваша собака способна самостоятельно в естественном процессе игры выполнить упражнения, необходимые для поддержания активности, здоровья и хорошего настроения. Не бойтесь обращаться за помощью к вашему заводчику или ветеринару, у них вы можете получить все необходимые рекомендации по уходу, подходящие именно вашей породе и именно вашему щенку."
                }
            ]
        },
        {
            "id": "18",
            "title1": "Умный дом: как подготовить ваше жилище для нового щенка.",
            "subTitle": "Будьте готовы к тому, что, когда ваш новый домашний любимец впервые появится в вашем доме, он будет не один… ведь вместе с очаровательным щенком в вашу жизнь войдет множество совершенно новых обязательств. Они разрушат устоявшийся порядок и полностью реорганизуют привычное жизненное пространство, подчинив значительную часть вашей жизни вопросам покупки правильного корма, обеспечения должного ухода и организации грамотного обучения.",
            "img": "./assets/img/articales/img/articles-details/статья18_биг.jpg",
            "body": [
                {
                    "type": "paragraph",
                    "text": "Первое появление дома вашего нового питомца многим будет похоже на появление маленького ребенка - это счастливый и одновременно очень волнующий момент. Щенок еще слишком мал, уязвим и беспомощен. Он не способен контролировать свой мочевой пузырь, он также не может самостоятельно обеспечить себе пищу и воду, он во всем полагается на вас и нуждается в вашей полной концентрации — хотя бы для того, чтобы просто уберечь его от неприятностей."
                },
                {
                    "type": "paragraph",
                    "text": "Вот почему ваш дом должен быть заранее тщательно подготовлен к появлению нового члена семьи. В этой статье вы найдете несколько важных подсказок, которые помогут вам убедиться в том, что вы все сделали правильно."
                },
                {
                    "type": "title",
                    "text": "1. Маленький дом внутри большого: обустройство своего места"
                },
                {
                    "type": "paragraph",
                    "text": "Если вы решили приучать щенка к собственному месту в доме, вам необходимо обустроить для него действительно комфортное пространство. Вам понадобится проволочный вольер такого размера, чтобы, находясь внутри, щенок мог свободно встать и развернуться. Внутрь вольера положите уютную и мягкую лежанку для сна, дополните жилище подушками, пледом или любимой игрушкой."
                },
                {
                    "type": "title",
                    "text": "2. Насущный вопрос: туалет для щенка"
                },
                {
                    "type": "paragraph",
                    "text": "Проконсультируйтесь с вашим тренером и заводчиком, как лучше всего приучить щенка к туалету. Возможно, вам стоит рассмотреть возможность использования впитывающих пеленок, которые могут стать удобным решением хотя бы на первое время. Многие владельцы предпочитают приобретать лотки или биотуалеты – обратите внимание на этот вариант, если вы остановили свой выбор на одной из некрупных пород."
                },
                {
                    "type": "title",
                    "text": "3. Чистые помыслы: о чистоте вашего дома"
                },
                {
                    "type": "paragraph",
                    "text": "Кстати, не забудьте приобрести специальные моющие средства, использование которых абсолютно безопасно для животных. Присмотритесь к ассортименту спреев-нейтрализаторов запаха и специальных средств для ликвидации пятен - поверьте, они не раз вам пригодятся."
                },
                {
                    "type": "title",
                    "text": "4. 100 вещей и ничего лишнего: подготовка инвентаря"
                },
                {
                    "type": "paragraph",
                    "text": "Выделите специальное место для хранения поводка, ошейника и любой другой амуниции, которая понадобится вам во время прогулок. Вы должны обсудить с вашим заводчиком, какой именно ошейник лучше всего подходит для породы вашей собаки. Не забудьте подготовиться к холодному времени года – вам нужно будет заранее позаботиться о приобретении специального костюма и пинеток, чтобы защитить вашу собаку от морозов. Также в самый первый день определите постоянное место для мисок с едой и водой, чтобы ваш питомец всегда знал, где он может получить все необходимое."
                },
                {
                    "type": "title",
                    "text": "5. Фейсконтроль: о запретных местах"
                },
                {
                    "type": "paragraph",
                    "text": "Любопытный щенок? Рекомендуем приобрести детские замки для ящиков и шкафов, особенно если у них есть ручка. Собаки некоторых пород более любопытны, чем другие, и легко проникают в места, где им быть совсем не положено. В первую очередь, это касается хранения чистящих средств или любых других веществ, потенциально опасных для животных."
                },
                {
                    "type": "title",
                    "text": "6. Что не так с вашей кухней: хранение продуктов"
                },
                {
                    "type": "paragraph",
                    "text": "Возможно, Вам придется подумать о переустройстве вашей кухни с точки зрения хранения именно человеческих продуктов питания. Прежде чем ваш щенок переедет в свой новый дом, внимательно проверьте свою кухню и другие места хранения пищи и минимизируйте риск, с которым может столкнуться ваш щенок. Разместите продукты в легкодоступной упаковке на недоступной для щенка высоте или начните использовать плотно закрывающиеся шкафы, чтобы предотвратить неприятности."
                },
                {
                    "type": "title",
                    "text": "7. Меню от шефа: правильное питание"
                },
                {
                    "type": "paragraph",
                    "text": "Отнеситесь серьезно к выбору корма и игрушек, которые буду ждать щенка в первый день в его новом доме. Щенку будет проще адаптироваться к условиям переезда, если вы не будете резко менять его пищевые привычки и предоставите ему еду, к которой он привык еще в питомнике. Обязательно проконсультируйтесь с вашим заводчиком и подберите бренд, который лучше всего подойдет именно вашему щенку. Также, если ваш питомец отдает предпочтение определенному виду игрушек (например, пищалки или мягкие игрушки), обязательно используйте их для снятия стресса и развития. Кроме того, у вас в запасе всегда должны быть специальные лакомства, которые станут отличной наградой или дополнительной мотивацией в процессе обучения щенка."
                },
                {
                    "type": "title",
                    "text": "8. Тихий час: правила здорового сна"
                },
                {
                    "type": "paragraph",
                    "text": "Подготовьте как можно больше мест для сна. Приобретите специальные мягкие домики, открытые лежанки, подушки и одеяла для вашего питомца и расположите их в разных местах вашего дома, чтобы щенок мог выбрать наиболее комфортное и удобное место. К тому же, из-за активного образа жизни щенкам требуется много часов качественного сна, поэтому постоянное наличие поблизости уютной кровати позволит вашему другу восстановить силы в тот момент, когда это потребуется."
                },
                {
                    "type": "title",
                    "text": "9. Игра в собачку: устранение опасностей"
                },
                {
                    "type": "paragraph",
                    "text": "Попробуйте опуститься на колени и взглянуть на ваш дом глазами щенка. Это может показаться глупым, но именно так вы сможете заметить все предметы, попадающие в поле зрения вашего питомца, и убрать их, если это необходимо. Спрячьте все потенциально опасные для собаки элементы (например, провода или предметы бытовой химии), а затем позаботьтесь и о вещах, для которых уже сам щенок представляет нешуточную опасность (например, задумайтесь о приобретении нового шкафа для обуви)."
                },
                {
                    "type": "title",
                    "text": "10. “Приятно познакомиться”: постепенная адаптация"
                },
                {
                    "type": "paragraph",
                    "text": "В вашем доме живут другие домашние животные или маленькие дети? Тогда вам нужен тщательный план социальной адаптации щенка в новых условиях."
                },
                {
                    "type": "paragraph",
                    "text": "Первое время ваш новый питомец, вероятно, будет испытывать сильный стресс при встрече со всем новым и незнакомым. Помните, что чрезмерное волнение в таком раннем возрасте может привести к нарушениям психики собаки и различным нежелательным поведенческим отклонениям. Поэтому так важно оберегать щенка от стрессовых ситуаций и давать ему возможность постепенно привыкать к новым обстоятельствам его жизни."
                },
                {
                    "type": "title",
                    "text": "11. Признак мастерства: распорядок дня"
                },
                {
                    "type": "paragraph",
                    "text": "Подготовьте оптимальный распорядок для вашего питомца, но не забудьте, что придерживаться его придется и вам. Разумеется, потребуется какое-то время, чтобы приучить щенка гулять, есть и спать тогда, когда положено, поэтому сначала любой ваш план будет казаться совершенно беспомощным и нереалистичным. Тем не менее, вам необходимо заранее составить четкое представление о том, как будет проходить день вашего питомца, и согласовать его со всеми членами вашей семьи."
                },
                {
                    "type": "paragraph",
                    "text": "Конечно, существует целое множество специфических деталей, которые будущему хозяину необходимо учитывать при подготовке дома для нового щенка, и эта статья лишь поможет вам разобраться в основах. Если подготовительные этапы вызывают у вас какие-либо трудности или вы не уверены в том, что сделали всю работу правильно, просто обратитесь за помощью к своему заводчику, который сможет объяснить вам все нюансы. Вы также можете проконсультироваться с вашим ветеринаром или тренером на обучающих курсах, чтобы создать действительно комфортные условия для вашего щенка."
                }
            ]
        },
        {
            "id": "19",
            "title1": "Это ваша собака: как выбрать идеальное имя для нового питомца",
            "subTitle": "Процесс выбора идеального имени для вашего щенка может оказаться труднее, чем вам покажется сперва, — в этой статье вы найдете вдохновение, которое поможет вам погрузиться в процесс.",
            "img": "./assets/img/articales/img/articles-details/статья19_биг.jpg",
            "body": [
                {
                    "type": "paragraph",
                    "text": "Этот момент настал, и вот, наконец, ваш щенок дома. Кажется, пришло время выбрать имя для нового члена вашей семьи. На самом деле, это не самое простое решение, и многие люди проводят не один день, размышляя над «тем самым» именем для своей собаки. Даже если сейчас вам кажется, что вы в очередной раз зашли в тупик – просто расслабьтесь. Выбор клички – это же такой веселый и увлекательный процесс, он знаменует собой начало вашего долгого и счастливого путешествия с новым другом, поэтому просто получайте удовольствие."
                },
                {
                    "type": "paragraph",
                    "text": "Вам кажется, что вы выбрали слишком «человеческое» или, может быть, слишком модное и распространенное имя для вашего питомца? Поверьте, вы не одиноки в своих переживаниях. Вот первый совет от профессионалов: попробуйте проанализировать, какое имя вам было бы комфортно использовать в разговоре. Вы должны быть готовы повторять его действительно часто, так, словно вы ведете диалог с вашим любимцем. Да, даже если сейчас это кажется вам странным, вы будете постоянно разговаривать с вашей собакой, поэтому выбирая для щенка имя, рассматривайте его, прежде всего, как личность."
                },
                {
                    "type": "paragraph",
                    "text": "Специалисты рекомендуют дать собаке имя, состоящее из двух слогов, - так питомцу будет проще различать вашу интонацию при обращении к нему и он быстро научится понимать ваши эмоции. Это поможет в процессе обучения и воспитания, а также, когда вам просто нужно будет срочно позвать собаку или обратить на себя ее внимание. Кроме того, стоит избегать имен, которые рифмуются с командами, которым вы, в конечном итоге, обучите свою собаку. Кличка должна быть легкой и удобной в произношении, но если вам хочется выбрать имя подлиннее и покрасивее, не ограничивайте себя - просто сразу придумайте его сокращенную (и, конечно, уменьшительно-ласкательную) версию."
                },
                {
                    "type": "paragraph",
                    "text": "На самом деле, есть довольно много источников, предлагающих возможные имена для вашего будущего питомца. Например, попробуйте ознакомиться с подборкой 20-ти самых популярных имен:"
                },
                {
                    "type": "list",
                    "text": [
                        "Макс",
                        "Чарли",
                        "Бадди",
                        "Купер",
                        "Джек",
                        "Тоби",
                        "Роки",
                        "Оливер",
                        "Тедди",
                        "Бастер",
                        "Белла",
                        "Люси",
                        "Молли",
                        "Дейзи",
                        "Мэгги",
                        "Софи",
                        "Лола",
                        "Хлоя",
                        "Рокси",
                        "Коко"
                    ]
                },
                {
                    "type": "paragraph",
                    "text": "Если ни один из этих вариантов не вдохновил вас, или если вы все же предпочитаете дать своему щенку уникальное имя — попробуйте рассмотреть несколько популярных категорий. Не обязательно останавливаться на одном из предложенных вариантов – используйте вашу фантазию."
                },
                {
                    "type": "title",
                    "text": "Аппетитные имена: идеи для владельцев-гурманов или «вечно голодных» щенков:"
                },
                {
                    "type": "list",
                    "text": [
                        "Базилик",
                        "Кекс",
                        "Фисташка",
                        "Долька",
                        "Имбирь",
                        "Пряник",
                        "Булочка",
                        "Корица",
                        "Оливка",
                        "Пармезан",
                        "Ваниль"
                    ]
                },
                {
                    "type": "title",
                    "text": "Вдохновляясь миром вокруг: если вы поэт или биолог или ваш питомец очень любит прогулки на свежем воздухе:"
                },
                {
                    "type": "list",
                    "text": [
                        "Клевер",
                        "Жасмин",
                        "Роза",
                        "Лютик",
                        "Алмаз",
                        "Апрель",
                        "Ландыш",
                        "Вьюга",
                        "Луна",
                        "Волна",
                        "Гром",
                        "Пух"
                    ]
                },
                {
                    "type": "title",
                    "text": "Мой щенок – супер-звезда: имена из поп-культуры для владельцев, которые идут в ногу со временем, и их необычных щенков:"
                },
                {
                    "type": "list",
                    "text": [
                        "Арья",
                        "Рианна",
                        "Гомес",
                        "Кайли",
                        "Карди",
                        "Роналду",
                        "Лео",
                        "Поттер",
                        "Ходор",
                        "Симба",
                        "Канье",
                        "Бонд",
                        "Фиона"
                    ]
                },
                {
                    "type": "title",
                    "text": "Со смыслом: имена, проверенные временем, подойдут для мудрых хозяев и питомцев-аристократов:"
                },
                {
                    "type": "list",
                    "text": [
                        "Рекс – Король. Для щенка голубых кровей.",
                        "Фидель – верный. Для нового преданного друга.",
                        "Теодор – дар от Бога. Для самого долгожданного питомца.",
                        "Винсент – победитель. Для будущего участника соревнований и выставок.",
                        "Витус – жизнерадостный. Для самого активного и счастливого.",
                        "Декстер – умный. Для рассудительного с самого детства.",
                        "Клеменс – нежный. Для любителя объятий и поцелуев.",
                        "Джули – полная молодости. Для активной и веселой девочки.",
                        "Альба – чистая. Для собаки с белой шерстью и бескорыстными помыслами.",
                        "Люси – несущая свет. Для той, что принесла счастье в новый дом.",
                        "Петра – судьба. Для собаки, изменившей вашу жизнь.",
                        "Маргарет – жемчужина. Для вашей главной драгоценности.",
                        "Хилари – радость. Для самой жизнерадостной и позитивной.",
                        "Камилла – верная. Для преданной спутницы жизни."
                    ]
                },
                {
                    "type": "title",
                    "text": "Для самых маленьких: очаровательные имена для миниатюрных пород"
                },
                {
                    "type": "list",
                    "text": [
                        "Кнопка",
                        "Вольт",
                        "Джери",
                        "Каспер",
                        "Маффин",
                        "Принц",
                        "Керли",
                        "Грета",
                        "Герда",
                        "Тутти",
                        "Пуля"
                    ]
                },
                {
                    "type": "title",
                    "text": "Больше, чем имя: варианты для собак крупных пород или питомцев с огромной душой"
                },
                {
                    "type": "list",
                    "text": [
                        "Альфа",
                        "Альба",
                        "Афина",
                        "Клык",
                        "Ральф",
                        "Аслан",
                        "Нептун",
                        "Цезарь",
                        "Балто",
                        "Гектор",
                        "Рокси",
                        "Челси",
                        "Клеопатра"
                    ]
                },
                {
                    "type": "paragraph",
                    "text": "Итак, если вас все еще не зацепило ни одно из предложенных имен, попробуйте найти свою собственную категорию, которая была бы вам интересна. Например, можете перебрать названия любимых брендов, пофантазировать о странах и городах, которые вас привлекают, вспомнить имена персонажей любимой книги…"
                },
                {
                    "type": "paragraph",
                    "text": "На самом деле, вы можете не торопиться с выбором клички, совсем не обязательно принимать решение в первый день: попробуйте понаблюдать за вашем питомцем, получше узнать его. И, самое главное – какой бы выбор вы ни сделали, получайте удовольствие от самого процесса и ориентируйтесь только на свои эмоции и ощущения. Поверьте, лучшее имя для вашего питомца – это то, которое вы будете произносить часто и с улыбкой на лице. Удачи! "
                }
            ]
        },
        {
            "id": "20",
            "title1": "Безопасное лето: 9 важных советов для владельцев собак",
            "subTitle": "Важно, чтобы каждый хозяин знал о потенциальных угрозах, с которыми питомец может столкнуться в тёплое время года.",
            "img": "./assets/img/articales/img/articles-details/статья20_биг.jpg",
            "body": [
                {
                    "type": "paragraph",
                    "text": "Лето - всеми любимое время шашлыков, приключений и семейных поездок. Однако, если вместе с вами в путешествие отправляется ваш пушистый друг, вам придётся внимательно следить за его безопасностью."
                },
                {
                    "type": "paragraph",
                    "text": "Вот несколько пунктов, которые помогут вашей собаке оставаться счастливой и здоровой в летние месяцы:"
                },
                {
                    "type": "title",
                    "text": "1. Договоримся на берегу: внимательно следите за питомцем, если вы находитесь рядом с водоемом"
                },
                {
                    "type": "paragraph",
                    "text": "Собираетесь на озеро? Разрешили собаке побегать возле бассейна? Отправляетесь на пляж? Все эти места могут быть опасны для щенка, если он ещё не умеет плавать, поэтому всегда держите собаку подальше от воды или установите специальные ограждения вокруг бассейна. Щенки неуклюжи и еще не знают, чего им на самом деле следует опасаться, вот почему вам нужно позаботиться об их безопасности, когда вы находитесь рядом с крупным водоемом. Также рекомендуется после купания всегда смывать хлор или соль из воды с вашей собаки, чтобы защитить ее от вредных химикатов."
                },
                {
                    "type": "title",
                    "text": "2. “Держать голову в холоде…”: убедитесь, что ваша собака имеет доступ к воде и всегда может охладиться"
                },
                {
                    "type": "paragraph",
                    "text": "Крайне важно, чтобы ваш щенок всегда имел доступ к свежей прохладной воде. Это может уберечь его от перегревания, что особенно важно в жаркие дни или дни с повышенной влажностью."
                },
                {
                    "type": "title",
                    "text": "3. Место под солнцем: проверьте, что у щенка всегда есть доступ к тенистым местам на улице"
                },
                {
                    "type": "paragraph",
                    "text": "Каждый раз, когда ваш щенок находится вместе с вами на открытом воздухе, обязательно предоставьте ему возможность находиться в тени, чтобы он мог вовремя охладиться. Питомец не должен задерживаться на открытом солнце или лежать на горячем тротуаре в течение продолжительных периодов времени, а постоянное наличие поблизости прохладного места для отдыха поможет ему безопасно провести время с вами."
                },
                {
                    "type": "title",
                    "text": "4. Новое правило дорожного движения: никогда не оставляйте собаку одну в припаркованной машине"
                },
                {
                    "type": "paragraph",
                    "text": "Пребывание в машине в течение любого периода времени и даже при включенном кондиционере может быть очень опасно для вашей собаки. Как на открытом солнце, так и в тени температура в машине может расти быстрее, чем кажется (ориентировочно на 10-15 градусов за каждые 10 минут), и очень скоро она может достичь губительной для вашего питомца отметки. Будьте осторожны и никогда не оставляйте свою собаку в запертой машине без присмотра даже на самое короткое время."
                },
                {
                    "type": "title",
                    "text": "5. Разумные жертвы: перенесите прогулку с собакой на более прохладное время суток"
                },
                {
                    "type": "paragraph",
                    "text": "Самое жаркое время суток, как правило, с 12 до 3 часов дня – именно в это время накапливается тепло. Даже если ваша собака приучена к прогулкам в этот конкретный промежуток времени, безопаснее будет принести привычный распорядок в жертву и отложить ее длительные прогулки на более прохладное время дня – раннее утро или, соответственно, поздний вечер. Также ветеринары рекомендуют держать собаку подальше от асфальта, потому что перегретая за день поверхность может обжечь чувствительные лапы питомца."
                },
                {
                    "type": "title",
                    "text": "6. Питомцы вашего питомца: примите необходимые меры предосторожности, если вы планируете посетить места потенциального обитания клещей, комаров и других вредоносных насекомых"
                },
                {
                    "type": "paragraph",
                    "text": "Если вы планируете посетить районы, известные высокой популяцией клещей или, например, блох, проконсультируйтесь с вашим ветеринаром, прежде чем отправляться на прогулку. Специалист сможет предложить эффективные профилактические лекарства для вашего щенка, чтобы защитить его от возможных опасностей."
                },
                {
                    "type": "title",
                    "text": "7. Окно в мир: внимательно следите за своей собакой, если поблизости есть открытые окна (особенно если они защищены москитной сеткой)"
                },
                {
                    "type": "paragraph",
                    "text": "Как известно, любопытство собак (и особенно щенков) не имеет границ – забывая обо всем, они смело отправляются на расследования и начинают охоту за возбудившими их интерес предметами. Поэтому, если в вашем доме открыто окно, внимательно следите за своим любознательным питомцем. Специальная сетка на окне может создавать иллюзию безопасности, однако, на самом деле, она легко выскакивает под действием определенной приложенной силы, которой вполне может обладать ваша собака."
                },
                {
                    "type": "title",
                    "text": "8. Пикник для людей, а не для собаки: будьте внимательны к тому, чем вы кормите вашу собаку, когда берете ее с собой в поездки"
                },
                {
                    "type": "paragraph",
                    "text": "Для людей перекус на свежем воздухе – безусловно, одна из приятных частей лета, не все же делиться угощениями с маленьким другом надо осторожно. Собака по-прежнему должна оставаться послушной и соблюдать сбалансированную диету."
                },
                {
                    "type": "paragraph",
                    "text": "Вот список продуктов, категорически противопоказанных для собак: изюм, виноград, лук, шоколад, а также все продукты с ксилитом (а это, между прочим, любые сладости, консервы и молочные сосиски – частые гости на летнем столе). Если вы берете какие-то из этих продуктов на пикник, помните, что они могут нанести вред здоровью вашей собаки. Поэтому лучше заранее позаботиться о специальном корме и безопасных лакомствах для вашего друга."
                },
                {
                    "type": "title",
                    "text": "9. Предупрежден, значит вооружен: помните о признаках перегревания"
                },
                {
                    "type": "paragraph",
                    "text": "Как владельцу собаки, вам важно знать признаки перегрева, чтобы вы могли вовремя применить профилактические меры. Наиболее распространенные признаки включают тяжелое дыхание, учащенное сердцебиение, повышение температуры тела, чрезмерное слюнотечение или жажду, а также красные десны, отсутствие координации, рвоту или летаргию. Важно помнить, что влажность воздуха может также привести к перегреву, так как собака просто не сможет остыть в нужный момент."
                },
                {
                    "type": "paragraph",
                    "text": "Тепловой удар может быть чрезвычайно опасным и иногда смертельным, особенно у пород, склонных к проблемам с дыханием, среди которых мопсы, бульдоги, боксеры, шарпеи и ши-тцу. Поскольку собаки не имеют физической способности потеть, их основным источником регулирования температуры является интенсивное дыхание, нарушение которого становится главным сигналом опасности для здоровья или даже жизни."
                },
                {
                    "type": "paragraph",
                    "text": "Прежде всего, внимательно следите за своим щенком на открытом воздухе и предоставьте ему возможность пить воду или перемещаться в тень в любой момент. Не заставляйте его слишком много тренироваться, когда на улице жарко и влажно, а также следите за любыми признаками перегрева или теплового удара. Когда ваш любимец находятся в доме, убедитесь, что он имеет доступ к прохладному и удобному месту для отдыха."
                },
                {
                    "type": "paragraph",
                    "text": "И все же помните, что несмотря на опасность, которую может представлять для собак теплая погода, летние месяцы – это отличная возможность провести незабываемое время с вашим питомцем. "
                }
            ]
        },
        {
            "id": "21",
            "title1": "8 ошибок, которых важно избегать, когда в вашем доме появится щенок",
            "subTitle": "В этой статье мы расскажем о самых распространенных ошибках новоиспеченных хозяев и научим избегать их с самых первых дней.",
            "img": "./assets/img/articales/img/articles-details/статья21.jpg",
            "body": [
                {
                    "type": "paragraph",
                    "text": "Даже если вы прочитали все существующие книги о воспитании собак и посмотрели все обучающие видеоролики для будущих владельцев, вы все равно непременно совершите некоторые ошибки в первые месяцы жизни с вашим щенком. Конечно, можно учиться на собственных ошибках, но ведь намного проще предотвратить их, правда же?"
                },
                {
                    "type": "paragraph",
                    "text": "Вот перечень самых популярных оплошностей и заблуждений, которые необходимо обнаружить и обезвредить прямо сейчас."
                },
                {
                    "type": "title",
                    "text": "1. Слишком рано для дрессировки"
                },
                {
                    "type": "paragraph",
                    "text": "Если вы считаете, что ваш щенок еще слишком мал для обучения, скорее всего, вы заблуждаетесь. В раннем возрасте щенки обладают огромным запасом энергии — вот почему важно начать тренировки как можно скорее. Основы воспитания и социализации собаки должны закладываться на самых ранних этапах развития. Именно эти первые месяцы жизни щенка являются решающими в его полноценном и своевременном развитии, поэтому посещение базовых занятий можно начинать уже с возраста 8 недель."
                },
                {
                    "type": "title",
                    "text": "2. Клетка – это ограничение свободы"
                },
                {
                    "type": "paragraph",
                    "text": "На самом деле, специальный вольер – это эффективный инструмент для домашнего обучения вашего щенка. Во-первых, собаки не любят загрязнять свои маленькие жилища, поэтому вам будет проще приучить щенка к туалету в нужных местах. Более того, такое закрытое пространство станет самым комфортным и безопасным местом для отдыха щенка в его новом доме. Не менее важно, что вольер – это понятная граница, которая поможет щенку понять, что в доме существуют правила, которые необходимо соблюдать."
                },
                {
                    "type": "paragraph",
                    "text": "Лучше всего расположить клетку или барьерные ограничители в темном месте, чтобы слишком яркий свет и обилие звуков не вызывали беспокойства и не нарушали отдых питомца. По этой причине никогда не используйте вольер как наказание — он должен всегда оставаться спокойным и уютным местом, в котором собака будет чувствовать себя защищенной. С другой стороны, нельзя допускать, чтобы щенок проводил в клетке слишком много времени – важно, чтобы его физические и социальные потребности всегда были удовлетворены."
                },
                {
                    "type": "title",
                    "text": "3. Наказание за ошибки вместо поощрения успехов"
                },
                {
                    "type": "paragraph",
                    "text": "Обучение, основанное на вознаграждении, поможет вашему щенку отмечать и запоминать моменты, когда его поведение было правильным, вместо того чтобы сосредоточиться на ошибках. Каждая собака мотивирована по-разному, поэтому так важно найти особый ключ, который станет понятным стимулом к работе именно для вашего щенка. Это может быть лакомство, корм, игрушка, развлечение или особое проявление любви и расположения хозяина. Обязательно \"отметьте\" правильное поведение вашего щенка с помощью кликера или короткого слова (например, «да» или «хорошо»), а затем вознаградите питомца. Вскоре щенок начнет ассоциировать ваш \"маркер\" с наградой — что станет основой его положительного поведения. Обучение щенка требует много времени, усилий и терпения с обеих сторон, но использование системы поощрений станет прочным фундаментом доверия между вами и вашим маленьким другом."
                },
                {
                    "type": "title",
                    "text": "4. Социализация – это естественный процесс, не требующий дополнительных действий"
                },
                {
                    "type": "paragraph",
                    "text": "Крайне важно, чтобы еще в самом раннем возрасте щенок понял, что другие животные, незнакомые люди и вообще любые объекты внешнего мира безопасны. Очень короткий период до достижения щенком трехмесячного возраста имеет ключевое значение для его дальнейшей социализации в жизни. Если в течение этого времени щенок не будет социализирован должным образом, это может привести к проблемному поведению и психическим отклонениям во взрослом возрасте. Занятия по социализации с профессиональным тренером помогут вашему щенку получить этот новый важный опыт, но в остальное время вы также должны делать все возможное чтобы на ранних стадиях развития ваш питомец видел как можно больше новых людей, детей, животных и мест."
                },
                {
                    "type": "title",
                    "text": "5. Угощение щенка едой со стола"
                },
                {
                    "type": "paragraph",
                    "text": "Начните формировать правильные пищевые привычки собаки с самых первых дней ее пребывания в вашем доме –  приучите щенка к специальному корму из его миски каждый день в одно и тоже время. Человеческая пища может быть вредна для вашего питомца, поэтому постарайтесь не делать исключений и никогда не кормить своего щенка со стола. Еда воспринимается собакой как заслуженное вознаграждение, поэтому, получая эти желанные угощения снова и снова, она лишь будет продолжать это делать. По этой причине вы должны установить строгие пищевые границы, чтобы в дальнейшем избежать развития привычки попрошайничества."
                },
                {
                    "type": "paragraph",
                    "text": "Если вы все же иногда угощаете своего питомца чем-то особенным, убедитесь, что такая пища полностью безопасна для него. В список разрешенных продуктов попадут, например, морковь, арахисовое масло, яйца, лосось, черника, арбуз (без кожуры), ежевика и сладкий картофель. В то же время, держите вашу собаку подальше от винограда, изюма, молочных продуктов, дрожжевого теста, орехов, шоколада, кофе, лука, чеснока и зеленого лука. Главное правило – всегда давайте собаке какую-либо пищу ответственным образом, а редкое появление в рационе необычных «человеческих» продуктов не должно формировать у питомца негативные привычки."
                },
                {
                    "type": "title",
                    "text": "6. Долгий сон вреден и является причиной гиперактивности щенка"
                },
                {
                    "type": "paragraph",
                    "text": "На самом деле, длительный сон – это одна из важнейших потребностей вашего маленького друга. Щенки могут спать до 18-20 часов в день, что считается абсолютной нормой. В раннем возрасте ваша собака активно и беспрерывно растет, а полноценное развитие на этом этапе сопровождается играми и различными активными движениями, для которых щенку требуется действительно много энергии. Ежедневно ваш питомец обрабатывает новую информацию в быстром темпе, постоянно приобретая новый волнующий опыт. Поэтому обязательно убедитесь, что ваш любимец имеет комфортное место для сна в любое время дня. Это может быть вольер или просто тихое темное место, где никто не потревожит щенка, пока он спит."
                },
                {
                    "type": "paragraph",
                    "text": "Собаки нуждаются в четкой последовательности и структуре, поэтому старайтесь тщательно следовать ежедневному расписанию, и скоро вы заметите, что у вашего щенка сформировались правильные привычки. Сон и время отхода ко сну также могут стать частью повседневного распорядка вашего щенка. "
                },
                {
                    "type": "title",
                    "text": "7. Дом – это безопасное место для щенка"
                },
                {
                    "type": "paragraph",
                    "text": "На самом деле, найти полностью безопасное место для активного и любопытного щенка практически невозможно, и ваш дом – не исключение. Другое дело, что вы обязаны сделать все возможное, чтобы предотвратить возможные неприятности. Вы даже не заметите лежащие на полу провода или неубранную пару ботинок у двери, но вот для вашего щенка все эти предметы выглядят интересно и очень аппетитно. Однако взаимодействие питомца с ними может быть крайне опасно, поэтому вам придется всегда быть на чеку. Взгляните на ваш дом глазами щенка (да-да, в прямом смысле встаньте на четвереньки) и, обнаружив все возможные угрозы, найдите способ ликвидировать их."
                },
                {
                    "type": "paragraph",
                    "text": "Есть несколько простых приемов, которые значительно облегчат вашу работу – всегда закрывайте или выносите мусор, прячьте любые провода и зарядные устройства, убирайте лекарства или чистящие средства в плотно закрывающийся ящик и постарайтесь очистить дом от любых мелких или острых предметов."
                },
                {
                    "type": "paragraph",
                    "text": "Если у вас есть двор, убедитесь, что он полностью огорожен, а в заборе нет ни малейшего отверстия для побега вашего любопытного щенка. Кроме того, перед каждой прогулкой используйте средство от клещей (или приобретите специальный ошейник) и не выпускайте щенка на улицу, если вы недавно обработали свой газон инсектицидами или пестицидами. Наконец, никогда не оставляйте щенка на улице без присмотра слишком надолго, ведь даже если вы полностью защитили свой дом и двор,он может найти для себя новые неприятности, предугадать которые порой просто невозможно."
                },
                {
                    "type": "title",
                    "text": "8. Эмоциональные расставания и встречи – привычный ежедневный ритуал"
                },
                {
                    "type": "paragraph",
                    "text": "Момент, когда вы возвращаетесь домой к своему щенку, может быть счастливым и  захватывающим для вас обоих. Но каждый раз, когда вы снова уходите за дверь, вы испытываете грусть и чувство вины, на прощание осыпая питомца лакомствами и любовью. К сожалению, чем больше вы проявляете подобные эмоции, тем сильнее собака привыкает к тому, что встречи и расставания у двери - это большое и важное событие, по-настоящему драматический момент, и скоро начинает воспринимать его соответственно. Это сделает дверь в ваш дом местом постоянной тревоги, стресса и, как следствие, потенциального лая. Постарайтесь сделать ваше временное отсутствие не более, чем элементом ежедневного распорядка, не акцентируйте внимание на вашем приезде или отъезде, и тогда ваша собака будет относиться к этому с должным спокойствием."
                }
            ]
        },
        {
            "id": "22",
            "title1": "5 советов по кормлению вашего питомца",
            "subTitle": "Грамотное питание — залог здоровья собаки и хорошего самочувствия. Эта тема намного сложнее, чем 5 советов, которые мы приводим ниже, но попробуйте начать хотя бы с них.",
            "img": "./assets/img/articales/img/articles-details/статья22_биг.jpg",
            "body": [
                {
                    "type": "title",
                    "text": "1. Соблюдайте правильный баланс в рационе вашего питомца: 2/3  мяса и 1/3 растительной пищи"
                },
                {
                    "type": "paragraph",
                    "text": "К числу разрешенных видов мяса относятся: субпродукты (сердце, желудок, печень, легкие, почки), сухожилия и головы травоядных животных, словом, все то, что обычно отсекается в процессе разделывания мяса и не используется в приготовлении блюд для людей. Полезным дополнением рациона вашей собаки станет несоленая рыба, которую предварительно следует тщательно очистить от чешуи и костей. Запомните еще одну необычную рекомендацию: выбирайте мясо с легким душком, так как оно переваривается значительно проще и быстрее, чем свежее."
                },
                {
                    "type": "paragraph",
                    "text": "Меню растительной пищи для домашнего любимца может включать в себя рис, овес, рожь, пшеницу, манную крупу, пшено, а также некоторые овощи и фрукты."
                },
                {
                    "type": "title",
                    "text": "2. Не используйте сладости в качестве угощения"
                },
                {
                    "type": "paragraph",
                    "text": "Конечно, ваш питомец с радостью съест аппетитные конфеты, печенья и пирожные, однако вам следует внимательно контролировать объем его рациона. Подобные лакомства часто становятся причиной переедания и лишнего веса, который неизбежно ведет к появлению различных проблем со здоровьем. Не стоит завоевывать любовь собаки, подкармливая ее под столом желанными сладостями. Сформировать правильные пищевые привычки у вашего питомца поможет дрессировка: приучите его приступать к еде только по специальной команде “бери” или “можно”."
                },
                {
                    "type": "title",
                    "text": "3. Придерживайтесь четкого распорядка кормления"
                },
                {
                    "type": "paragraph",
                    "text": "До достижения возраста трех месяцев щенку необходимо получать пищу с интервалом 4 часа (например, в 8, 12, 16 и 20 часов). Когда он немного подрастет и ориентировочно до 7-месячного возраста, количество приемов пищи можно будет сократить до 3 раз в сутки (например, в 9, 15 и 19 часов). Далее, приблизительно с возраста 8 месяцев собака должна перейти на двухразовое питание, а со временем, когда она станет совсем взрослой, количество приемов пищи можно сократить до одного. Однако вне зависимости от необходимого количества кормлений, важно всегда соблюдать единственное условие - давать пищу домашнему любимцу следует строго в одно и то же время каждый день. Оптимальным для системы пищеварения взрослой собаки считается 24-часовой цикл кормления, однако одной из главных рекомендаций по-прежнему остается консультация ветеринара, который поможет точно определить идеальный распорядок кормления для вашего питомца."
                },
                {
                    "type": "title",
                    "text": "4. Формирование правильных пищевых привычек - первый и ключевой этап воспитания щенка"
                },
                {
                    "type": "paragraph",
                    "text": "Ваш щенок постоянно голоден, и это нормально. Но не удивляйтесь, если очень скоро он поймет, что еда находится не только в его миске, и он может получить желанные лакомства, например, в столовой во время обеда. Главная задача хозяина - оставаться непоколебимым и пресекать даже самые жалостливые попытки попрошайничества. Если вы уступите вашему питомцу всего один раз, это определенно будет начало конца: он станет требовать угощений все активнее, а вы со временем просто перестанете контролировать его рацион. Но если у вас получится игнорировать подобное поведение вашей собаки, и вы не дадите ей ни единого повода думать, что обеденный стол может стать для нее дополнительным источником еды, она быстро научится питаться правильно и забудет о пагубной привычке попрошайничать."
                },
                {
                    "type": "title",
                    "text": "5. Необходимо выделить пару часов для отдыха после каждого приема пищи, чтобы собака могла переварить все, что съела"
                },
                {
                    "type": "paragraph",
                    "text": "Это время нужно для того, чтобы питательные вещества могли как следует усвоиться в организме вашего питомца, а его энергетические ресурсы в полной мере восстановились."
                },
                {
                    "type": "paragraph",
                    "text": "Больше других в подобном отдыхе нуждаются молодые растущие собаки, потому что связки их скелета еще недостаточно укреплены, и активное движение сразу после еды может стать причиной растяжений и других серьезных травм."
                }
            ]
        },
        {
            "id": "23",
            "title1": "7 базовых советов по воспитанию ",
            "subTitle": "Воспитание щенка — важный процесс, в котором легко допустить ряд ошибок. Ниже мы приводим 7 базовых советов, которые помогут вам с этом нелегком процессе. ",
            "img": "./assets/img/articales/img/articles-details/статья23_биг.jpg",
            "body": [
                {
                    "type": "title",
                    "text": "1. Если щенок справил нужду в доме, вам следует предотвратить повторение этого неприятного инцидента при помощи специальных дезинфицирующих средств"
                },
                {
                    "type": "paragraph",
                    "text": "Необходимо полностью устранить, а затем перекрыть запах, оставленный вашим питомцем, потому что именно он сможет стать причиной новых неприятностей в ближайшем будущем. Обработайте загрязненный участок специальным химическим составом, незнакомый и достаточно резкий запах которого будет отталкивать собаку. Однако прежде чем приступить к ликвидации последствий при помощи профессиональных моющих средств, внимательно изучите их состав и меры предосторожности, чтобы убедиться что они полностью безопасны для вашего питомца."
                },
                {
                    "type": "title",
                    "text": "2. Чтобы собака научилась отличать вашу похвалу от недовольства, используйте разные интонации"
                },
                {
                    "type": "paragraph",
                    "text": "Если вы хотите похвалить собаку, ваш голос должен звучать мягко и приветливо в отличие от ситуации, когда вы стремитесь продемонстрировать свое неодобрение, меняя свою интонацию на более строгую и разговаривая резкими, отрывистыми фразам. Но даже когда вы ругаете своего питомца, не пытайтесь говорить громче, чем обычно, ведь собака слышит в 16 раз лучше человека. Вместо этого попробуйте сделать свой голос на несколько тонов ниже."
                },
                {
                    "type": "title",
                    "text": "3. Прибегайте к наказаниям только в крайних случаях, когда собака систематически игнорирует ваши команды"
                },
                {
                    "type": "paragraph",
                    "text": "Наказывайте собаку только тогда, когда она может понять настоящую причину вашего недовольства и следующего за ним наказания. Сначала внимательно проследите за поведением вашего питомца, чтобы понять, действительно ли он игнорирует ваше негодование и попытки призвать его к порядку, или же просто не понимает смысла ваших слов и интонаций. Только если вы смогли убедиться, что собака на самом деле распознает, но не принимает во внимание отданные вами команды, следует прибегнуть к более строгой мере - наказанию. Когда вы наказываете питомца, он обязательно должен находиться на поводке, потому что в противном случае он может проявить агрессию или даже убежать."
                },
                {
                    "type": "title",
                    "text": "4. Рука хозяина приободряет и успокаивает, но никогда не наказывает"
                },
                {
                    "type": "paragraph",
                    "text": "Ваши руки ассоциируются у питомца с нежностью, добротой, заботой и защитой, и это совершенно естественно. Ведь именно рукой вы гладите шерсть своей собаки, когда хотите приласкать ее или поиграть с ней, рукой даете корм, надеваете и снимаете ошейник, лечите, когда это необходимо."
                },
                {
                    "type": "paragraph",
                    "text": "Но всего одной вашей ошибки может быть достаточно, чтобы нарушить эти особые доверительные отношения: даже самый незначительный удар обладает достаточной силой, чтобы зародить в животном глубокое, близкое инстинктивному чувство страха, обиды или разочарования. Поэтому в процессе воспитания питомца очень важно держать эмоции под контролем и даже к наказанию подходить с должной ответственностью. Ни в коем случае не бейте собаку, вместо этого возьмите ее за шиворот - такое действие будет воспринято по-другому и не повлечет за собой тяжелых психологических последствий. Помните, что если собака боится руки своего хозяина, в этом виноват только сам хозяин."
                },
                {
                    "type": "title",
                    "text": "5. Никогда не бейте собаку ногами"
                },
                {
                    "type": "paragraph",
                    "text": "Запомните, что ни при каких условиях нельзя бить собаку ни рукой, ни, тем более, ногой. У ног своего хозяина собака привыкла искать защиту и спокойствие, в его ногах она особенно любит греться и засыпать. Всего один пинок сможет разрушить доверие, а ведь именно на нем строятся крепкие и счастливые отношения хозяина и питомца. Собака, которая однажды получит удар, вполне возможно, будет опасаться его повторения всю дальнейшую жизнь. Такое чувство тревоги может стать причиной серьезных нарушений психики и нервной системы, а также различных поведенческих отклонений, так как животному будет трудно, например, находиться на коротком поводке во время прогулок и выполнять команду «ко мне»."
                },
                {
                    "type": "title",
                    "text": "6. Когда хозяин наказывает свою собаку в присутствии свидетелей, важно, чтобы они не реагировали на происходящее открыто"
                },
                {
                    "type": "paragraph",
                    "text": "Каждый ребенок знает, что в присутствии посторонних людей его наказание не будет таким жестким и неопровержимым. Собаки чувствуют что-то похожее и при любой возможности стараются найти себе защитника, который поможет избежать наказания. Однако если это произойдет, авторитет хозяина будет поставлен под сомнение, а положение “вожака стаи” потеряет свою силу и власть."
                },
                {
                    "type": "title",
                    "text": "7. Поощрять собаку во время обучения может только ее учитель"
                },
                {
                    "type": "paragraph",
                    "text": "Специальные лакомства - это отличный вариант похвалы и закрепления результатов в процессе занятия, а также эффективный стимул для выполнения новых упражнений. Важно, чтобы во время тренировки, такие угощения собака могла получить только от своего тренера. Если же у собаки появляется альтернативная возможность получить желанный кусочек, не прикладывая для этого каких-либо усилий, разумеется, она будет с радостью ей пользоваться. В такой ситуации угощение перестает работать в качестве мотивации, интерес питомца к занятию пропадает, а прогресс от обучения замедляется."
                }
            ]
        }
    ]
}