{
    "clients":[
       {
          "id":"1",
          "subTitle":"Я Светлана Чеснокова, питомник «Из Сказграда»",
          "text": "Мы занимаемся племенным разведением померанских шпицев. Задача нашего питомника - здоровые физически, с хорошей психикой, максимально соответствующие стандарту породы щенки, которые, живя с Вами, никогда Вас не разочаруют. Мы будем рады помочь подобрать Вам щенка по характеру и темпераменту. Покупая щенка у нас, Вы получаете пожизненную всестороннюю помощь и советы.",
          "url": "https://petman.co/breeder/8918",
          "img":"./assets/img/client-page/zavodchik1.png"
       },
       {
         "id":"2",
         "subTitle":"Я Наталья Терехова, питомник «Snow Legend»",
         "text": "Наш питомник расположен за городом. На территории питомника огромный, благоустроенный выгул. Чистые, светлые и большие вольеры. Имеется огромный вольер для щенков с собственным выгулом. Все наши собаки работают в упряжке и получают необходимую физическую нагрузку.",
         "url": "https://petman.co/breeder/7597",
         "img":"./assets/img/client-page/zavodchik3.png"
      },
      {
         "id":"3",
         "subTitle":"Я Юлия Дябина, питомник «Aromat Stepey»",
         "text": "Наш молодой питомник создан в 2016 году. В питомник были приобретены собаки из Германии, зарекомендовавшие себя не только как высокопородные особи, но и превосходные охотники. Происхождение собак тщательно подбиралось, что позволяет нам приблизиться к немецкому идеалу в породе. У всех собак проверки по немецкой системе, что и в дальнейшем мы будем продолжать делать!",
         "url": "https://petman.co/breeder/7250",
         "img":"./assets/img/client-page/zavodchik4.png"
      },
      {
         "id":"4",
         "subTitle":"Я Мокшина Оксана, питомник «Меланди» ",
         "text": "Являюсь заводчиком с 10-летним стажем, имею кинологическое образование. Первый голден появился в нашем доме в 2008 году, первый помет родился в 2010, а питомник был зарегистрирован в 2011. Среди наших выпускников есть чемпионы и победители выставок, охотники, спортсмены и просто домашние любимцы.",
         "url": "https://petman.co/breeder/6809",
         "img":"./assets/img/client-page/zavodchik5.png"
      },
      {
         "id":"5",
         "subTitle":"Я Турчанинова Юлия, питомник «Из дивного рая»",
         "text": "В нашем питомнике живут 5 собак породы чау чау, 4 дамы и один кавалер. Не представляю свою жизнь без чау, как и все члены моей семьи. Я тщательно наблюдаю за ростом и развитием щенков. В данный момент у нас подрастают три замечательных малыша кремового окраса, которые с нетерпением ждут переезда в новый дом.",
         "url": "https://petman.co/breeder/8448",
         "img":"./assets/img/client-page/zavodchik2.png"
      }
    ]
 }